# Big heading
_especialwritting

In [5]:
def add_numbers(a, b, c=None):
    if c == None:
        return a+b
    else:
        return a+b+c

print(add_numbers(2,4))
print(add_numbers(2,4, 4))

6
10

In [6]:
type(add_numbers)

function

In [7]:
type('Hola')

str

In [8]:
x = (1,'a', [2,3,2])
type(x)

tuple

In [10]:
x = [1,2,3,2, [21]]
type(x)

list

In [12]:
x.append(3)
x

[1, 2, 3, 2, [21], 3, 3]

In [13]:
for i in x:
    print(i)

1
2
3
2
[21]
3
3

In [14]:
x[0]

1

In [15]:
x[5]

3

In [18]:
[1,2]+[5,2]

[1, 2, 5, 2]

In [34]:
x ='Esta es una prueba'
print(x[:3])
print(x[-6:-1])
print(x[3:])

Est
prueb
a es una prueba

In [35]:
nombre = 'Eduardo'
apellido = 'Montero'

print(nombre + ' ' +apellido)
print(nombre *3)
print('Edu' in nombre)

Eduardo Montero
EduardoEduardoEduardo
True

In [39]:
nombre = 'Eduardo Jose Montero Bermudez'.split()[0]
apellido = 'Eduardo Jose Montero Bermudez'.split()[2]

print(nombre)
print(apellido)

Eduardo
Montero

In [42]:
x = {'Eduardo': 'ejmontero10@gmail.com',
     'Rodolfo': 'ejermonto@gmail.com'}
x['Jose']= 'jose@gmail.com'
type(x)

dict

In [43]:
for name in x:
    print(x[name])

ejmontero10@gmail.com
ejermonto@gmail.com
jose@gmail.com

In [45]:
for email in x.values():
    print(email)

ejmontero10@gmail.com
ejermonto@gmail.com
jose@gmail.com

In [46]:
for key, value in x.items():
    print(key + ':'+ value)

Eduardo:ejmontero10@gmail.com
Rodolfo:ejermonto@gmail.com
Jose:jose@gmail.com

In [47]:
nombre, apellido, email = ('Eduardo', 'Montero', 'ejmontero10@gmail.com')
print(nombre)
print(apellido)
print(email)

Eduardo
Montero
ejmontero10@gmail.com

In [49]:
sales_record = {'price': 3.2,
                'num_items': 4,
                'person':'Edu'}

sales_statement = '{} compró {} items a un precio de {} cada uno teniendo un total de {}'

print(sales_statement.format(sales_record['person'], 
                             sales_record['num_items'],
                             sales_record['price'],
                             sales_record['price'] * sales_record['num_items']                           
))

Edu compró 4 items a un precio de 3.2 cada uno teniendo un total de 12.8

In [52]:
import datetime as dt
import time as tm

In [53]:
tm.time()

1658108084.01

In [58]:
dtnow = dt.datetime.fromtimestamp(tm.time())
dtnow

datetime.datetime(2022, 7, 17, 22, 35, 45, 700815)

In [61]:
dtnow.year, dtnow.month, dtnow.day, dtnow.hour, dtnow.minute, dtnow.second

(2022, 7, 17, 22, 35, 45)

In [71]:
import datetime as dt

today = dt.date.today()
today

datetime.date(2022, 7, 17)

In [72]:
delta = dt.timedelta(days = 100)

In [73]:
today + delta

datetime.date(2022, 10, 25)

In [74]:
class Person:
    department = 'School of information'

    def set_name(self, new_name):
        self.name = new_name

    def set_location(self, new_location):
        self.location = new_location

In [75]:
pepe = Person()

In [77]:
pepe = Person()
pepe.set_name('Eduardo')
pepe.set_location('Argentina')

print('{} vive en {} y trabaja en el departamento de {}'.format(pepe.name, pepe.location, pepe.department))

Eduardo vive en Argentina y trabaja en el departamento de School of information

In [82]:
x = [2,3,3,5]
y = [5,34,2,1]
mappear = map(min, x, y)
list(mappear)

[2, 3, 2, 1]

In [81]:
people = ['Dr. Christopher Brooks', 'Dr. Kevyn Collins-Thompson', 'Dr. VG Vinod Vydiswaran', 'Dr. Daniel Romero']

def split_title_and_name(person):
    title = person.split()[0]
    lastname = person.split()[2]
    return title + lastname

list(map(split_title_and_name, people))

['Dr.Brooks', 'Dr.Collins-Thompson', 'Dr.Vinod', 'Dr.Romero']

In [84]:
people = ['Dr. Christopher Brooks', 'Dr. Kevyn Collins-Thompson', 'Dr. VG Vinod Vydiswaran', 'Dr. Daniel Romero']

def split_title_lastname(person):
    title = person.splot()[0]
    name = person.split()[1]
    return title + name 

list(map(split_title_and_name, people))

['Dr.Brooks', 'Dr.Collins-Thompson', 'Dr.Vinod', 'Dr.Romero']

In [85]:
# lambda es una funcion anonima
my_function = lambda a, b, c : a + b

In [86]:
my_function (2,3,4)

5

In [91]:
function = lambda a,b,c : a + b + c
function(3,4,2)

9

In [94]:
lowercase = 'abcdefghijklmnopqrstuvwxyz'
digits = '0123456789'

In [102]:
lowercase = 'abcd'
digits = '0123'

[a+b+c+d for a in digits for b in digits for c in lowercase for d in lowercase]

['00aa',
 '00ab',
 '00ac',
 '00ad',
 '00ba',
 '00bb',
 '00bc',
 '00bd',
 '00ca',
 '00cb',
 '00cc',
 '00cd',
 '00da',
 '00db',
 '00dc',
 '00dd',
 '01aa',
 '01ab',
 '01ac',
 '01ad',
 '01ba',
 '01bb',
 '01bc',
 '01bd',
 '01ca',
 '01cb',
 '01cc',
 '01cd',
 '01da',
 '01db',
 '01dc',
 '01dd',
 '02aa',
 '02ab',
 '02ac',
 '02ad',
 '02ba',
 '02bb',
 '02bc',
 '02bd',
 '02ca',
 '02cb',
 '02cc',
 '02cd',
 '02da',
 '02db',
 '02dc',
 '02dd',
 '03aa',
 '03ab',
 '03ac',
 '03ad',
 '03ba',
 '03bb',
 '03bc',
 '03bd',
 '03ca',
 '03cb',
 '03cc',
 '03cd',
 '03da',
 '03db',
 '03dc',
 '03dd',
 '10aa',
 '10ab',
 '10ac',
 '10ad',
 '10ba',
 '10bb',
 '10bc',
 '10bd',
 '10ca',
 '10cb',
 '10cc',
 '10cd',
 '10da',
 '10db',
 '10dc',
 '10dd',
 '11aa',
 '11ab',
 '11ac',
 '11ad',
 '11ba',
 '11bb',
 '11bc',
 '11bd',
 '11ca',
 '11cb',
 '11cc',
 '11cd',
 '11da',
 '11db',
 '11dc',
 '11dd',
 '12aa',
 '12ab',
 '12ac',
 '12ad',
 '12ba',
 '12bb',
 '12bc',
 '12bd',
 '12ca',
 '12cb',
 '12cc',
 '12cd',
 '12da',
 '12db',
 '12dc',
 '12dd',
 '13aa',
 '13ab',
 '13ac',
 '13ad',
 '13ba',
 '13bb',
 '13bc',
 '13bd',
 '13ca',
 '13cb',
 '13cc',
 '13cd',
 '13da',
 '13db',
 '13dc',
 '13dd',
 '20aa',
 '20ab',
 '20ac',
 '20ad',
 '20ba',
 '20bb',
 '20bc',
 '20bd',
 '20ca',
 '20cb',
 '20cc',
 '20cd',
 '20da',
 '20db',
 '20dc',
 '20dd',
 '21aa',
 '21ab',
 '21ac',
 '21ad',
 '21ba',
 '21bb',
 '21bc',
 '21bd',
 '21ca',
 '21cb',
 '21cc',
 '21cd',
 '21da',
 '21db',
 '21dc',
 '21dd',
 '22aa',
 '22ab',
 '22ac',
 '22ad',
 '22ba',
 '22bb',
 '22bc',
 '22bd',
 '22ca',
 '22cb',
 '22cc',
 '22cd',
 '22da',
 '22db',
 '22dc',
 '22dd',
 '23aa',
 '23ab',
 '23ac',
 '23ad',
 '23ba',
 '23bb',
 '23bc',
 '23bd',
 '23ca',
 '23cb',
 '23cc',
 '23cd',
 '23da',
 '23db',
 '23dc',
 '23dd',
 '30aa',
 '30ab',
 '30ac',
 '30ad',
 '30ba',
 '30bb',
 '30bc',
 '30bd',
 '30ca',
 '30cb',
 '30cc',
 '30cd',
 '30da',
 '30db',
 '30dc',
 '30dd',
 '31aa',
 '31ab',
 '31ac',
 '31ad',
 '31ba',
 '31bb',
 '31bc',
 '31bd',
 '31ca',
 '31cb',
 '31cc',
 '31cd',
 '31da',
 '31db',
 '31dc',
 '31dd',
 '32aa',
 '32ab',
 '32ac',
 '32ad',
 '32ba',
 '32bb',
 '32bc',
 '32bd',
 '32ca',
 '32cb',
 '32cc',
 '32cd',
 '32da',
 '32db',
 '32dc',
 '32dd',
 '33aa',
 '33ab',
 '33ac',
 '33ad',
 '33ba',
 '33bb',
 '33bc',
 '33bd',
 '33ca',
 '33cb',
 '33cc',
 '33cd',
 '33da',
 '33db',
 '33dc',
 '33dd']

In [103]:
import numpy as np
import math

In [106]:
a = np.array([1,2,3,2,1,2])
print(a)
print(a.ndim)

[1 2 3 2 1 2]
1

In [110]:
b = np.array([[1,2,3,4,5], [6,7,8,9,10]])
print(b)
print(b.ndim)

[[ 1  2  3  4  5]
 [ 6  7  8  9 10]]
2

In [111]:
b.shape

(2, 5)

In [113]:
b.dtype

dtype('int64')

In [114]:
b.dtype.name

'int64'

In [115]:
c = np.array([2.2, 5, 1.1])

In [116]:
c

array([2.2, 5. , 1.1])

In [119]:
d = np.zeros((2,3))
f = np.ones((2,3))

In [120]:
print(d)

[[0. 0. 0.]
 [0. 0. 0.]]

In [121]:
print(f)

[[1. 1. 1.]
 [1. 1. 1.]]

In [123]:
np.random.rand(2,3)

array([[0.50411651, 0.63448236, 0.84875658],
       [0.73463596, 0.00987205, 0.93730912]])

In [127]:
f = np.arange(0, 50, 2)
f

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32,
       34, 36, 38, 40, 42, 44, 46, 48])

In [131]:
# cantidad de numeros que estan entre 0 a 50
np.linspace(0, 50, 3)

array([ 0., 25., 50.])

In [133]:
a = np.array([10,20,30,40])
b = np.array([1,2,3,4])

c = a-b
print(c)

d = a*b
print(d)

[ 9 18 27 36]
[ 10  40  90 160]

In [134]:
f = np.array([0, -10, -5, 15, 0])
c = (f -31) *5/9

In [135]:
f

array([  0, -10,  -5,  15,   0])

In [136]:
c

array([-17.22222222, -22.77777778, -20.        ,  -8.88888889,
       -17.22222222])

In [137]:
c > 10

array([False, False, False, False, False])

In [138]:
c%2 == 0

array([False, False,  True, False, False])

In [139]:
A = np.array([[1,1],[0,1]])
B = np.array([[2,0],[3,4]])

print(A*B)

[[2 0]
 [0 4]]

In [140]:
print(A@B) # multiplicación de matrices

[[5 4]
 [3 4]]

In [141]:
A.shape

(2, 2)

In [5]:
array1 = np.array([[1,2,3], [4,5,6]])
print(array1.dtype)

int64

In [6]:
import numpy as np

In [7]:
array2 = np.array([[1,2,3.4], [4,5,6]])
print(array2.dtype)

float64

In [9]:
array3 = array1+array2
print(array3)
print(array3.dtype)

[[ 2.   4.   6.4]
 [ 8.  10.  12. ]]
float64

In [10]:
print(array3.sum())
print(array3.max())
print(array3.min())
print(array3.mean())

42.4
12.0
2.0
7.066666666666666

In [14]:
b = np.arange(1,16, 1).reshape(3,5)
print(b)

[[ 1  2  3  4  5]
 [ 6  7  8  9 10]
 [11 12 13 14 15]]

In [15]:
a = np.array([1,3,5,7,9])
a[2]

5

In [17]:
a = np.array([[1,2],[3,4],[5,6]])
a

array([[1, 2],
       [3, 4],
       [5, 6]])

In [18]:
a[1,1]

4

In [19]:
np.array([a[0,0], a[1,1,], a[2,1]])

array([1, 4, 6])

In [20]:
## boolean indexing
a

array([[1, 2],
       [3, 4],
       [5, 6]])

In [21]:
print(a>5)

[[False False]
 [False False]
 [False  True]]

In [22]:
print(a[a>5])

[6]

In [24]:
a = np.array([0,1,2,3,4,5])
print(a[:3])

[0 1 2]

In [25]:
print(a[0:3])

[0 1 2]

In [26]:
print(a[2:4])

[2 3]

In [40]:
a = np.array([[1,2,3,4],[5,6,7,8], [9,10,11,12]])
a

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12]])

In [30]:
a[:2]

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

In [35]:
a[0:2,1:3] #rows and columns

array([[2, 3],
       [6, 7]])

In [41]:
sub_array = a[0:2,1:3]
print(sub_array[0,0])
sub_array[0,0] = 50
print(sub_array[0,0])
print(a[0,1])

2
50
50

In [45]:
import pandas as pd

df = pd.read_csv('../Datasets/Admission_Predict.csv')

In [56]:
graduate_admission = pd.read_csv('../Datasets/Admission_Predict.csv')
graduate_admission.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [59]:
graduate_admission = graduate_admission['CGPA'].to_numpy()

In [62]:
graduate_admission.shape

(400,)

In [66]:
graduate_admission = graduate_admission /10*4
graduate_admission[0:20]

array([1.544 , 1.4192, 1.28  , 1.3872, 1.3136, 1.4944, 1.312 , 1.264 ,
       1.28  , 1.376 , 1.344 , 1.44  , 1.456 , 1.28  , 1.312 , 1.328 ,
       1.392 , 1.28  , 1.408 , 1.36  ])

In [67]:
len(graduate_admission)

400

In [71]:
graduate_admission[graduate_admission==1]

array([], dtype=float64)

In [75]:
graduate_admission = pd.read_csv('../Datasets/Admission_Predict.csv')
graduate_admission.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [84]:
print(graduate_admission[graduate_admission['Chance of Admit ']>0.8]['GRE Score'].mean())
print(graduate_admission[graduate_admission['Chance of Admit ']<0.4]['GRE Score'].mean())
print(graduate_admission[graduate_admission['Chance of Admit ']<0.4]['GRE Score'].mean())

328.7350427350427
302.2857142857143
302.2857142857143

In [80]:
graduate_admission.columns

Index(['Serial No.', 'GRE Score', 'TOEFL Score', 'University Rating', 'SOP',
       'LOR ', 'CGPA', 'Research', 'Chance of Admit '],
      dtype='object')

In [85]:
import re

In [87]:
text = 'This is a good day'
if re.search('good', text):
    print('Great')
else:
    print('Its bad')

Great

In [88]:
text = 'Eduardo trabaja duro. Eduardo tiene buenas notas. Eduardo es exitoso.'
re.split('Eduardo', text)

['', ' trabaja duro. ', ' tiene buenas notas. ', ' es exitoso.']

In [89]:
text = 'Eduardo trabaja duro. Eduardo tiene buenas notas. Eduardo es exitoso.'
text.split('Eduardo')

['', ' trabaja duro. ', ' tiene buenas notas. ', ' es exitoso.']

In [90]:
re.findall('Eduardo', text)

['Eduardo', 'Eduardo', 'Eduardo']

In [92]:
text = 'Eduardo trabaja duro. Eduardo tiene buenas notas. Eduardo es exitoso.'
re.search('^Eduardo', text)

In [128]:
grades = 'ACAAAABBBBBAACABCCB'
re.findall('B', grades)

['B', 'B', 'B', 'B', 'B', 'B', 'B']

In [129]:
re.findall('[AB]', grades)

['A', 'A', 'A', 'A', 'A', 'B', 'B', 'B', 'B', 'B', 'A', 'A', 'A', 'B', 'B']

In [130]:
re.findall('[A][B-C]', grades)

['AC', 'AB', 'AC', 'AB']

In [131]:
re.findall('AB|AC', grades)

['AC', 'AB', 'AC', 'AB']

In [132]:
re.findall('[^A]', grades)

['C', 'B', 'B', 'B', 'B', 'B', 'C', 'B', 'C', 'C', 'B']

In [133]:
# busca las el caracter que empieza y que no sea A, como no hay entonces devuelve una lista vacia
re.findall('^[^A]', grades)

[]

In [134]:
# minima y maxima cantidad de veces que A aparece repetida
re.findall('A{2,10}', grades)

['AAAA', 'AA']

In [135]:
grades

'ACAAAABBBBBAACABCCB'

In [136]:
# muestra las AA 
re.findall('A{1,1}A{1,1}', grades)

['AA', 'AA', 'AA']

In [137]:
re.findall('A{2}', grades)

['AA', 'AA', 'AA']

In [138]:
re.findall('AA', grades)

['AA', 'AA', 'AA']

In [139]:
grades

'ACAAAABBBBBAACABCCB'

In [140]:
re.findall('A{1,10}B{1,10}C{1,10}', grades)

['ABCC']

In [142]:
with open('../Datasets/ferpa.txt', 'r') as file:
    wiky = file.read()

In [143]:
wiky

'Overview[edit]\nFERPA gives parents access to their child\'s education records, an opportunity to seek to have the records amended, and some control over the disclosure of information from the records. With several exceptions, schools must have a student\'s consent prior to the disclosure of education records after that student is 18 years old. The law applies only to educational agencies and institutions that receive funds under a program administered by the U.S. Department of Education.\n\nOther regulations under this act, effective starting January 3, 2012, allow for greater disclosures of personal and directory student identifying information and regulate student IDs and e-mail addresses.[2] For example, schools may provide external companies with a student\'s personally identifiable information without the student\'s consent.[2]\n\nExamples of situations affected by FERPA include school employees divulging information to anyone other than the student about the student\'s grades or behavior, and school work posted on a bulletin board with a grade. Generally, schools must have written permission from the parent or eligible student in order to release any information from a student\'s education record.\n\nThis privacy policy also governs how state agencies transmit testing data to federal agencies, such as the Education Data Exchange Network.\n\nThis U.S. federal law also gave students 18 years of age or older, or students of any age if enrolled in any post-secondary educational institution, the right of privacy regarding grades, enrollment, and even billing information unless the school has specific permission from the student to share that specific type of information.\n\nFERPA also permits a school to disclose personally identifiable information from education records of an "eligible student" (a student age 18 or older or enrolled in a postsecondary institution at any age) to his or her parents if the student is a "dependent student" as that term is defined in Section 152 of the Internal Revenue Code. Generally, if either parent has claimed the student as a dependent on the parent\'s most recent income tax statement, the school may non-consensually disclose the student\'s education records to both parents.[3]\n\nThe law allowed students who apply to an educational institution such as graduate school permission to view recommendations submitted by others as part of the application. However, on standard application forms, students are given the option to waive this right.\n\nFERPA specifically excludes employees of an educational institution if they are not students.\n\nThe act is also referred to as the Buckley Amendment, for one of its proponents, Senator James L. Buckley of New York.\n\nAccess to public records[edit]\nThe citing of FERPA to conceal public records that are not "educational" in nature has been widely criticized, including by the act\'s primary Senate sponsor.[4] For example, in the Owasso Independent School District v. Falvo case, an important part of the debate was determining the relationship between peer-grading and "education records" as defined in FERPA. In the Court of Appeals, it was ruled that students placing grades on the work of other students made such work into an "education record." Thus, peer-grading was determined as a violation of FERPA privacy policies because students had access to other students\' academic performance without full consent.[5] However, when the case went to the Supreme Court, it was officially ruled that peer-grading was not a violation of FERPA. This is because a grade written on a student\'s work does not become an "education record" until the teacher writes the final grade into a grade book.[6]\n\nStudent medical records[edit]\nLegal experts have debated the issue of whether student medical records (for example records of therapy sessions with a therapist at an on-campus counseling center) might be released to the school administration under certain triggering events, such as when a student sued his college or university.[7][8]\n\nUsually, student medical treatment records will remain under the protection of FERPA, not the Health Insurance Portability and Accountability Act (HIPAA). This is due to the "FERPA Exception" written within HIPAA.[9]'

In [144]:
re.findall('[a-zA-z]{1,100}\[edit\]', wiky)

['Overview[edit]', 'records[edit]', 'records[edit]']

In [146]:
#w any letter de 1 a 100 veces seguido de la palabra edit
re.findall('[\w]{1,100}\[edit\]', wiky)

['Overview[edit]', 'records[edit]', 'records[edit]']

In [148]:
# * es cualquier caracter, \ sirve para emparejar patrones
re.findall('[\w]*\[edit\]', wiky)

['Overview[edit]', 'records[edit]', 'records[edit]']

In [150]:
# * es cualquier caracter, \ sirve para emparejar patrones (aca incluimos tmb el espacio en blanco)
re.findall('[\w ]*\[edit\]', wiky)

['Overview[edit]',
 'Access to public records[edit]',
 'Student medical records[edit]']

In [152]:
x = re.findall('[\w ]*\[edit\]', wiky)
for title in x:
    print(title.split('[edit]')[0])

Overview
Access to public records
Student medical records

In [155]:
# Separa en Grupos de busqueda
re.findall('([\w ]*)(\[edit\])', wiky)

[('Overview', '[edit]'),
 ('Access to public records', '[edit]'),
 ('Student medical records', '[edit]')]

In [156]:
type(re.findall('([\w ]*)(\[edit\])', wiky))

list

In [161]:
x = re.findall('([\w ]*)(\[edit\])', wiky)
for item in x:
    print(item)

('Overview', '[edit]')
('Access to public records', '[edit]')
('Student medical records', '[edit]')

In [162]:
x = re.findall('([\w ]*)(\[edit\])', wiky)
for item in x:
    print(item[0])

Overview
Access to public records
Student medical records

In [163]:
re.finditer('(?P<title>[\w ]*)(?P<edit_link>\[edit\])', wiky)

In [164]:
# tiene titulo y tiene edit_link
for item in re.finditer('(?P<title>[\w ]*)(?P<edit_link>\[edit\])', wiky):
    print(item.groupdict()['title'])

Overview
Access to public records
Student medical records

In [165]:

for item in re.finditer('(?P<title>[\w ]*)(?P<edit_link>\[edit\])', wiky):
    print(item.groupdict()['edit_link'])

[edit]
[edit]
[edit]

In [167]:
item.groupdict()['title']

'Student medical records'

## Look-ahead and look behind

In [172]:
x = re.finditer('(?P<title>[\w ]+)(?=\[edit\])', wiky)
for item in x:
    print(item)

<re.Match object; span=(0, 8), match='Overview'>
<re.Match object; span=(2715, 2739), match='Access to public records'>
<re.Match object; span=(3692, 3715), match='Student medical records'>

In [173]:
with open('../Datasets/buddhist.txt', 'r') as file:
    wiki = file.read()

In [174]:
wiki

'Buddhist universities and colleges in the United States\nFrom Wikipedia, the free encyclopedia\nJump to navigationJump to search\n\nThis article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: "Buddhist universities and colleges in the United States" – news · newspapers · books · scholar · JSTOR (December 2009) (Learn how and when to remove this template message)\nThere are several Buddhist universities in the United States. Some of these have existed for decades and are accredited. Others are relatively new and are either in the process of being accredited or else have no formal accreditation. The list includes:\n\nDhammakaya Open University – located in Azusa, California, part of the Thai Wat Phra Dhammakaya[1]\nDharmakirti College – located in Tucson, Arizona Now called Awam Tibetan Buddhist Institute (http://awaminstitute.org/)\nDharma Realm Buddhist University – located in Ukiah, California\nEwam Buddhist Institute – located in Arlee, Montana\nNaropa University is located in Boulder, Colorado (Accredited by the Higher Learning Commission)\nInstitute of Buddhist Studies – located in Berkeley, California\nMaitripa College – located in Portland, Oregon\nSoka University of America – located in Aliso Viejo, California\nUniversity of the West – located in Rosemead, California\nWon Institute of Graduate Studies – located in Glenside, Pennsylvania\nReferences[edit]\n^ Banchanon, Phongphiphat (3 February 2015). รู้จัก "เครือข่ายธรรมกาย" [Getting to know the Dhammakaya network]. Forbes Thailand (in Thai). Retrieved 11 November 2016.\nExternal links[edit]\nList of Buddhist Universities and Colleges in the world\n'

In [180]:
pattern = """ 
(?P<title>.*) #The university title
(~\ located\ in\ ) #an indicator of the location
(?P<city>\w*)   #city the university is in
(,\ )           #separador for the state
(?P<state>\w*)   #the state the city is located in
"""
for item in re.finditer(pattern, wiki, re.VERBOSE):
    print(item.groupdict())

In [399]:
with open('../Datasets/nytimeshealth.txt') as file:
    health = file.read()

In [183]:
pattern = "#[\w\d]*(?=\s)"

In [185]:
# get all the hash tags
re.findall(pattern, health)

['#askwell',
 '#pregnancy',
 '#Colorado',
 '#VegetarianThanksgiving',
 '#FallPrevention',
 '#Ebola',
 '#Ebola',
 '#ebola',
 '#Ebola',
 '#Ebola',
 '#EbolaHysteria',
 '#AskNYT',
 '#Ebola',
 '#Ebola',
 '#Liberia',
 '#Excalibur',
 '#ebola',
 '#Ebola',
 '#dallas',
 '#nobelprize2014',
 '#ebola',
 '#ebola',
 '#monrovia',
 '#ebola',
 '#nobelprize2014',
 '#ebola',
 '#nobelprize2014',
 '#Medicine',
 '#Ebola',
 '#Monrovia',
 '#Ebola',
 '#smell',
 '#Ebola',
 '#Ebola',
 '#Ebola',
 '#Monrovia',
 '#Ebola',
 '#ebola',
 '#monrovia',
 '#liberia',
 '#benzos',
 '#ClimateChange',
 '#Whole',
 '#Wheat',
 '#Focaccia',
 '#Tomatoes',
 '#Olives',
 '#Recipes',
 '#Health',
 '#Ebola',
 '#Monrovia',
 '#Liberia',
 '#Ebola',
 '#Ebola',
 '#Liberia',
 '#Ebola',
 '#blood',
 '#Ebola',
 '#organtrafficking',
 '#EbolaOutbreak',
 '#SierraLeone',
 '#Freetown',
 '#SierraLeone',
 '#ebolaoutbreak',
 '#kenema',
 '#ebola',
 '#Ebola',
 '#ebola',
 '#ebola',
 '#Ebola',
 '#ASMR',
 '#AIDS2014',
 '#AIDS',
 '#MH17',
 '#benzos']

In [205]:
x = 'www.aBC.com, abc.com, ab_c.de8f.com abc, abc..com'

In [210]:
re.findall('[a-zA-Z]{1,20}.[a-zA-Z]{1,20}.[a-zA-Z]{1,20}', x)

['www.aBC.com', 'abc.com', 'ab_c.de', 'f.com abc']

In [222]:
re.findall('\w*.\w*.\w*', x)

['www.aBC.com', ', abc', '.com,', ' ab_c.de8f', '.com abc', ', abc', '..com']

In [227]:
x = 'hola'

In [262]:
x = 'unicorn'

In [263]:
re.findall('^[aeiou].*[^aeiou]$', x)

['unicorn']

In [499]:
x = '0o117'

In [549]:
re.findall('\A0o\d+$', x)

[]

In [547]:
x = '0o12f'

In [534]:
re.findall('\A0x\w+|\A0x\d+', x)

[]

In [558]:
x = '0o12f'

In [559]:
re.findall('\A0o\d+$|\A0x\w+|\A0x\d+', x)

[]

In [430]:
x = '*olas1234'
re.findall('\A[a-z]+[0-9]+|\A[0-9].+', x)

[]

In [497]:
x = 'Px4122'
re.findall('\APx\d+', x)

['Px4122']

In [562]:
def l2_dist(a, b):
    result = ((a - b) * (a - b)).sum()
    result = result ** 0.5
    return result

In [565]:
l2_dist(a, b)

ValueError: operands could not be broadcast together with shapes (3,4) (3,5)

In [571]:
a1 = np.random.rand(4)
a2 = np.random.rand(4, 1)
a3 = np.array([[1, 2, 3, 4]])
a4 = np.arange(1, 4, 1)
a5 = np.linspace(1 ,10, 4)

In [572]:
a1.shape

(4,)

In [573]:
a5

array([ 1.,  4.,  7., 10.])

In [574]:
import numpy as np

old = np.array([[1, 1, 1], [1, 1, 1]])
new = old
new[0, :2] = 0

print(old)

[[0 0 1]
 [1 1 1]]

In [578]:
old = np.array([[1, 2, 3], [4, 5, 6]])
old[0, :2]

array([1, 2])

In [579]:
old

array([[1, 2, 3],
       [4, 5, 6]])

In [621]:
x = np.array(np.random.random_sample(36)*100)
y = np.array(list(map(int, x))).reshape(6,6)
y

array([[63, 54,  8, 25, 45, 85],
       [80, 25, 68, 91, 79, 57],
       [70, 35, 35, 41, 89, 27],
       [58, 91, 11, 58, 68, 57],
       [26, 67, 15, 62, 68, 90],
       [74, 36, 20, 78, 77, 72]])

In [640]:
import re 
s = 'ACBCAC'

re.findall('^AC', s)

['AC']

In [632]:
p[4:6]

array([45, 85])

In [ ]:
p = np.array(list(map(int, x)))
p

array([63, 54,  8, 25, 45, 85, 80, 25, 68, 91, 79, 57, 70, 35, 35, 41, 89,
       27, 58, 91, 11, 58, 68, 57, 26, 67, 15, 62, 68, 90, 74, 36, 20, 78,
       77, 72])

In [643]:
import re
s = 'ACAABAACAAAB'
result = re.findall('A{1,2}', s)
L = len(result)

In [661]:
 x = np.array(np.random.random_sample(36))*100
 y = np.array(list(map(int, x))).reshape(6,6)
 y[1:3,1:3]

array([[13, 66],
       [18, 89]])

In [662]:
y

array([[91, 33, 87, 27, 68, 29],
       [ 3, 13, 66,  9, 94, 15],
       [60, 18, 89, 54, 80, 87],
       [24, 15, 46, 61, 20, 67],
       [66, 78, 84, 75, 23, 48],
       [80, 32, 23, 72, 50, 29]])

In [663]:
import re
def names():
    simple_string = """Amy is 5 years old, and her sister Mary is 2 years old. 
    Ruth and Peter, their parents, have 3 kids."""

    # YOUR CODE HERE
    return re.findall('[A-Z]\w+', simple_string)

    raise NotImplementedError()

In [ ]:
import re
def grades():
    with open ("assets/grades.txt", "r") as file:
        grades = file.read()

    return re.findall('\w+\s\w+: B', grades)
    raise NotImplementedError()

In [ ]:
host = re.findall('\d+\.\d+\.\d+\.\d+', logdata)
host

In [ ]:
user_name = re.findall('[a-zA-Z]{2,10}\d+', logdata)
user_name

In [ ]:
#time 
re.findall('\d+/[a-zA-z]+/\d+:\d+:\d+:\d+\s-\d+', logdata)

In [ ]:
#request 
re.findall('\w+\s/.+', logdata)

In [ ]:
host = re.findall('\d+\.\d+\.\d+\.\d+', logdata)
user_name = len(re.findall('[a-zA-Z]{2,10}\d+', logdata))
time = re.findall('\d+/[a-zA-z]+/\d+:\d+:\d+:\d+\s-\d+', logdata)
request = re.findall('\w+\s/.+', logdata)

## Series Data Structure

In [664]:
import pandas as pd

In [665]:
students  = ['Alice', 'Molly', 'Jack']

In [666]:
pd.Series(students)

0    Alice
1    Molly
2     Jack
dtype: object

In [667]:
# A faster way to create a series is base on a numpy array instead of base on a list
numbers = [1,2,3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [668]:
# None in python indicate a lack of data

In [669]:

students = ['Alice', 'Molly', None]
pd.Series(students)
# None is None in an object Serie

0    Alice
1    Molly
2     None
dtype: object

In [670]:
numbers = [1,2, None]
pd.Series(numbers)
# None is Nan in an float Serie

0    1.0
1    2.0
2    NaN
dtype: float64

In [672]:
import numpy as np

np.nan == None

False

In [674]:
np.nan == np.nan

False

In [676]:
np.isnan(np.nan)

True

In [677]:
students_score = {'Alice':'Physics',
                  'Jack':'Chemistry',
                  'Molly': 'English'}
s = pd.Series(students_score)
s

Alice      Physics
Jack     Chemistry
Molly      English
dtype: object

In [678]:
s.index

Index(['Alice', 'Jack', 'Molly'], dtype='object')

In [681]:
students = [('Alice', 'Brown'), ('Jack', 'While'), ('Molly', 'Green')]
pd.Series(students)

0    (Alice, Brown)
1     (Jack, While)
2    (Molly, Green)
dtype: object

In [682]:
s = pd.Series(['Physics', 'Chemistry', 'English'], index =['Jack', 'Molly', 'Alice'])
s

Jack       Physics
Molly    Chemistry
Alice      English
dtype: object

In [684]:
students_score = {'Alice':'Physics',
                  'Jack':'Chemistry',
                  'Molly': 'English'}
s = pd.Series(students_score, index=['Alice', 'Jack', 'Sam'])
s

Alice      Physics
Jack     Chemistry
Sam            NaN
dtype: object

In [694]:
# Querying a Series by index
# iloc for value
# loc for index
# iloc and loc ar attributes [] the call a get or set

In [688]:
import pandas as pd

students_score = {'Alice':'Physics',
                  'Jack':'Chemistry',
                  'Molly': 'English',
                  'Sam': 'History'}
s = pd.Series(students_score)
s

Alice      Physics
Jack     Chemistry
Molly      English
Sam        History
dtype: object

In [690]:
s.iloc[3]

'History'

In [692]:
s.loc['Molly']

'English'

In [697]:
print(s[3])
print(s.iloc[3])

History
History

In [698]:
assert(s[3]==s.iloc[3])

In [701]:
assert(s['Molly'] == s.loc['Molly'])

In [703]:
# its better to use s.iloc[numeric_index] or s.loc['Index']

In [705]:
class_code = {99: 'Physics',
             100: 'Chemistry',
             101: 'English',
             102: 'History'}
s = pd.Series(class_code)

In [706]:
s[0]

KeyError: 0

In [708]:
grades = pd.Series([90, 80, 70, 60])

total = 0 
for grade in grades:
    total+=grade
print(total/len(grades))

75.0

In [709]:
import numpy as np

total = np.sum(grades)
print(total/len(grades))

75.0

In [710]:
grades

0    90
1    80
2    70
3    60
dtype: int64

In [713]:
grades.index = ['Eduardo', 'Jose', 'Francisco', 'Lautaro']

In [714]:
grades

Eduardo      90
Jose         80
Francisco    70
Lautaro      60
dtype: int64

In [715]:
grades.iloc[3]

60

In [716]:
grades.loc['Francisco']

70

In [717]:
import numpy as np

total = np.sum(grades)
print(total/len(grades))

75.0

In [718]:
numbers = pd.Series(np.random.randint(0,1000, 10000))
numbers.head()

0    959
1    998
2    721
3    452
4    433
dtype: int64

In [719]:
len(numbers)

10000

In [726]:
%%timeit -n 1
#magic functions
total = 0
for number in numbers:
    total += number
print(total/len(numbers))

496.776
496.776
496.776
496.776
496.776
496.776
496.776
4.66 ms ± 689 µs per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [734]:
%%timeit -n 1
#vectorization
total = np.sum(grades)
print(total/len(grades))

75.0
75.0
75.0
75.0
75.0
75.0
75.0
1.06 ms ± 430 µs per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [728]:
numbers.head()

0    959
1    998
2    721
3    452
4    433
dtype: int64

In [729]:
numbers+=2

In [730]:
numbers.head()

0     961
1    1000
2     723
3     454
4     435
dtype: int64

In [737]:
%%timeit -n 10
s = pd.Series(np.random.randint(0, 1000, 1000))
for label, value in s.iteritems():
    s.loc[label]=value+2

72.3 ms ± 11.3 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [739]:
%%timeit -n 10
s = pd.Series(np.random.randint(0, 1000, 1000))
s+=2
# Hay que vectorizar las operaciones usando numpy

518 µs ± 211 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [740]:
# Adding values in a Series using loc
s = pd.Series([1,2,3])
s.loc['History']=102
s

0            1
1            2
2            3
History    102
dtype: int64

In [741]:
s = pd.Series([1,2,3])
s.loc['History']=104
s

0            1
1            2
2            3
History    104
dtype: int64

In [742]:
students_classes = pd.Series({
    'Alice': 'Physics',
    'Jack':'chemistry',
    'Molly': 'English',
    'Sam':'History'
})
students_classes

Alice      Physics
Jack     chemistry
Molly      English
Sam        History
dtype: object

In [744]:
kelly_clases = pd.Series(['Philosophy', 'Arts', 'Maths'], index = ['Kelly', 'Kelly', 'Kelly'])
kelly_clases

Kelly    Philosophy
Kelly          Arts
Kelly         Maths
dtype: object

In [745]:
all_students = students_classes.append(kelly_clases)
all_students

/tmp/ipykernel_6849/1762696661.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  all_students = students_classes.append(kelly_clases)

Alice       Physics
Jack      chemistry
Molly       English
Sam         History
Kelly    Philosophy
Kelly          Arts
Kelly         Maths
dtype: object

In [746]:
students_classes

Alice      Physics
Jack     chemistry
Molly      English
Sam        History
dtype: object

In [747]:
students = pd.Series({'Eduardo': 'Maths',
                      'Claudio': 'Chemistry',
                      'Florencia': 'Nursery'})

In [749]:
students

Eduardo          Maths
Claudio      Chemistry
Florencia      Nursery
dtype: object

In [748]:
students.loc['Claudio']

'Chemistry'

In [750]:
students.iloc[1]

'Chemistry'

## Dataframe datastructure

In [754]:
# Dataframe datastructure
import pandas as pd

record1 = pd.Series({'Name': 'Eduardo',
                    'Class': 'Biology',
                    'Score': 90})

record2 = pd.Series({'Name': 'Julio',
                        'Class': 'Maths',
                        'Score': 80})

record3 = pd.Series({'Name': 'Julio',
                    'Class': 'Chemistry',
                    'Score': 90})

In [757]:
%timeit -n 10
# Creamos un dataframe en base a una secuencia de Series
df = pd.DataFrame([record1, record2, record3], index = ['school1', 'school2', 'school3'])

In [758]:
df

            Name      Class  Score
school1  Eduardo    Biology     90
school2    Julio      Maths     80
school3    Julio  Chemistry     90

In [766]:
# Creamos un dataframe en base a una lista de diccionarios
df = pd.DataFrame([{'Name': 'Eduardo',
       'Class': 'Biology',
       'Score': 90},
     {'Name': 'Julio',
      'Class': 'Maths',
      'Score': 80},
     {'Name': 'Julio',
      'Class': 'Chemistry',
      'Score': 90}    
     ], index =['school1', 'school2', 'school1'])

In [767]:
df

            Name      Class  Score
school1  Eduardo    Biology     90
school2    Julio      Maths     80
school1    Julio  Chemistry     90

In [768]:
df.loc['school2']

Name     Julio
Class    Maths
Score       80
Name: school2, dtype: object

In [769]:
type(df.loc['school2'])

pandas.core.series.Series

In [770]:
df.loc['school1']

            Name      Class  Score
school1  Eduardo    Biology     90
school1    Julio  Chemistry     90

In [771]:
type(df.loc['school1'])

pandas.core.frame.DataFrame

In [772]:
df.loc['school1', 'Name']

school1    Eduardo
school1      Julio
Name: Name, dtype: object

In [773]:
df.T

       school1 school2    school1
Name   Eduardo   Julio      Julio
Class  Biology   Maths  Chemistry
Score       90      80         90

In [774]:
df.T.index

Index(['Name', 'Class', 'Score'], dtype='object')

In [775]:
df.T.loc['Name']

school1    Eduardo
school2      Julio
school1      Julio
Name: Name, dtype: object

In [776]:
df['Name']

school1    Eduardo
school2      Julio
school1      Julio
Name: Name, dtype: object

In [777]:
type(df['Name'])

pandas.core.series.Series

In [779]:
df.loc['school1']['Name']

school1    Eduardo
school1      Julio
Name: Name, dtype: object

In [780]:
type(df.loc['school1'])

pandas.core.frame.DataFrame

In [781]:
type(df.loc['school1']['Name'])

pandas.core.series.Series

In [784]:
df.loc[:]

            Name      Class  Score
school1  Eduardo    Biology     90
school2    Julio      Maths     80
school1    Julio  Chemistry     90

In [785]:
df.loc[['school1', 'school2']]

            Name      Class  Score
school1  Eduardo    Biology     90
school1    Julio  Chemistry     90
school2    Julio      Maths     80

In [786]:
df.loc[:, ['Name', 'Class']]

            Name      Class
school1  Eduardo    Biology
school2    Julio      Maths
school1    Julio  Chemistry

In [791]:
df.loc[['school1', 'school2']][['Name', 'Class']]

            Name      Class
school1  Eduardo    Biology
school1    Julio  Chemistry
school2    Julio      Maths

In [793]:
df.loc[:, ['Name', 'Score']]

            Name  Score
school1  Eduardo     90
school2    Julio     80
school1    Julio     90

In [794]:
df.drop('school2')

            Name      Class  Score
school1  Eduardo    Biology     90
school1    Julio  Chemistry     90

In [795]:
df

            Name      Class  Score
school1  Eduardo    Biology     90
school2    Julio      Maths     80
school1    Julio  Chemistry     90

In [798]:
copy_df = df.copy()
copy_df.drop('Name', axis = 1, inplace = True) # axis =1 >> indica que vamos a dropear una columna
copy_df

             Class  Score
school1    Biology     90
school2      Maths     80
school1  Chemistry     90

In [799]:
copy_df.drop('school2', inplace= True)
copy_df

             Class  Score
school1    Biology     90
school1  Chemistry     90

In [797]:
del copy_df['Class']
copy_df

         Score
school1     90
school2     80
school1     90

In [800]:
df['classRanking'] = None
df

            Name      Class  Score classRanking
school1  Eduardo    Biology     90         None
school2    Julio      Maths     80         None
school1    Julio  Chemistry     90         None

In [801]:
# The dataframe is indexed by row and by column
!pwd

/media/eduardo/Datos/repo_personal/DataScience/coursera

In [803]:
!cat ../Datasets/Admission_Predict.csv

Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR ,CGPA,Research,Chance of Admit
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4,4.5,8.87,1,0.76
3,316,104,3,3,3.5,8,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.8
5,314,103,2,2,3,8.21,0,0.65
6,330,115,5,4.5,3,9.34,1,0.9
7,321,109,3,3,4,8.2,1,0.75
8,308,101,2,3,4,7.9,0,0.68
9,302,102,1,2,1.5,8,0,0.5
10,323,108,3,3.5,3,8.6,0,0.45
11,325,106,3,3.5,4,8.4,1,0.52
12,327,111,4,4,4.5,9,1,0.84
13,328,112,4,4,4.5,9.1,1,0.78
14,307,109,3,4,3,8,1,0.62
15,311,104,3,3.5,2,8.2,1,0.61
16,314,105,3,3.5,2.5,8.3,0,0.54
17,317,107,3,4,3,8.7,0,0.66
18,319,106,3,4,3,8,1,0.65
19,318,110,3,4,3,8.8,0,0.63
20,303,102,3,3.5,3,8.5,0,0.62
21,312,107,3,3,2,7.9,1,0.64
22,325,114,4,3,2,8.4,0,0.7
23,328,116,5,5,5,9.5,1,0.94
24,334,119,5,5,4.5,9.7,1,0.95
25,336,119,5,4,3.5,9.8,1,0.97
26,340,120,5,4.5,4.5,9.6,1,0.94
27,322,109,5,4.5,3.5,8.8,0,0.76
28,298,98,2,1.5,2.5,7.5,1,0.44
29,295,93,1,2,2,7.2,0,0.46
30,310,99,2,1.5,2,7.3,0,0.54
31,300,97,2,3,3,8.1,1,0.65
32,327,103,3,4,4,8.3,1,0.74
33,338,118,4,3,4.5,9.4,1,0.91
34,340,114,5,4,4,9.6,1,0.9
35,331,112,5,4,5,9.8,1,0.94
36,320,110,5,5,5,9.2,1,0.88
37,299,106,2,4,4,8.4,0,0.64
38,300,105,1,1,2,7.8,0,0.58
39,304,105,1,3,1.5,7.5,0,0.52
40,307,108,2,4,3.5,7.7,0,0.48
41,308,110,3,3.5,3,8,1,0.46
42,316,105,2,2.5,2.5,8.2,1,0.49
43,313,107,2,2.5,2,8.5,1,0.53
44,332,117,4,4.5,4,9.1,0,0.87
45,326,113,5,4.5,4,9.4,1,0.91
46,322,110,5,5,4,9.1,1,0.88
47,329,114,5,4,5,9.3,1,0.86
48,339,119,5,4.5,4,9.7,0,0.89
49,321,110,3,3.5,5,8.85,1,0.82
50,327,111,4,3,4,8.4,1,0.78
51,313,98,3,2.5,4.5,8.3,1,0.76
52,312,100,2,1.5,3.5,7.9,1,0.56
53,334,116,4,4,3,8,1,0.78
54,324,112,4,4,2.5,8.1,1,0.72
55,322,110,3,3,3.5,8,0,0.7
56,320,103,3,3,3,7.7,0,0.64
57,316,102,3,2,3,7.4,0,0.64
58,298,99,2,4,2,7.6,0,0.46
59,300,99,1,3,2,6.8,1,0.36
60,311,104,2,2,2,8.3,0,0.42
61,309,100,2,3,3,8.1,0,0.48
62,307,101,3,4,3,8.2,0,0.47
63,304,105,2,3,3,8.2,1,0.54
64,315,107,2,4,3,8.5,1,0.56
65,325,111,3,3,3.5,8.7,0,0.52
66,325,112,4,3.5,3.5,8.92,0,0.55
67,327,114,3,3,3,9.02,0,0.61
68,316,107,2,3.5,3.5,8.64,1,0.57
69,318,109,3,3.5,4,9.22,1,0.68
70,328,115,4,4.5,4,9.16,1,0.78
71,332,118,5,5,5,9.64,1,0.94
72,336,112,5,5,5,9.76,1,0.96
73,321,111,5,5,5,9.45,1,0.93
74,314,108,4,4.5,4,9.04,1,0.84
75,314,106,3,3,5,8.9,0,0.74
76,329,114,2,2,4,8.56,1,0.72
77,327,112,3,3,3,8.72,1,0.74
78,301,99,2,3,2,8.22,0,0.64
79,296,95,2,3,2,7.54,1,0.44
80,294,93,1,1.5,2,7.36,0,0.46
81,312,105,3,2,3,8.02,1,0.5
82,340,120,4,5,5,9.5,1,0.96
83,320,110,5,5,4.5,9.22,1,0.92
84,322,115,5,4,4.5,9.36,1,0.92
85,340,115,5,4.5,4.5,9.45,1,0.94
86,319,103,4,4.5,3.5,8.66,0,0.76
87,315,106,3,4.5,3.5,8.42,0,0.72
88,317,107,2,3.5,3,8.28,0,0.66
89,314,108,3,4.5,3.5,8.14,0,0.64
90,316,109,4,4.5,3.5,8.76,1,0.74
91,318,106,2,4,4,7.92,1,0.64
92,299,97,3,5,3.5,7.66,0,0.38
93,298,98,2,4,3,8.03,0,0.34
94,301,97,2,3,3,7.88,1,0.44
95,303,99,3,2,2.5,7.66,0,0.36
96,304,100,4,1.5,2.5,7.84,0,0.42
97,306,100,2,3,3,8,0,0.48
98,331,120,3,4,4,8.96,1,0.86
99,332,119,4,5,4.5,9.24,1,0.9
100,323,113,3,4,4,8.88,1,0.79
101,322,107,3,3.5,3.5,8.46,1,0.71
102,312,105,2,2.5,3,8.12,0,0.64
103,314,106,2,4,3.5,8.25,0,0.62
104,317,104,2,4.5,4,8.47,0,0.57
105,326,112,3,3.5,3,9.05,1,0.74
106,316,110,3,4,4.5,8.78,1,0.69
107,329,111,4,4.5,4.5,9.18,1,0.87
108,338,117,4,3.5,4.5,9.46,1,0.91
109,331,116,5,5,5,9.38,1,0.93
110,304,103,5,5,4,8.64,0,0.68
111,305,108,5,3,3,8.48,0,0.61
112,321,109,4,4,4,8.68,1,0.69
113,301,107,3,3.5,3.5,8.34,1,0.62
114,320,110,2,4,3.5,8.56,0,0.72
115,311,105,3,3.5,3,8.45,1,0.59
116,310,106,4,4.5,4.5,9.04,1,0.66
117,299,102,3,4,3.5,8.62,0,0.56
118,290,104,4,2,2.5,7.46,0,0.45
119,296,99,2,3,3.5,7.28,0,0.47
120,327,104,5,3,3.5,8.84,1,0.71
121,335,117,5,5,5,9.56,1,0.94
122,334,119,5,4.5,4.5,9.48,1,0.94
123,310,106,4,1.5,2.5,8.36,0,0.57
124,308,108,3,3.5,3.5,8.22,0,0.61
125,301,106,4,2.5,3,8.47,0,0.57
126,300,100,3,2,3,8.66,1,0.64
127,323,113,3,4,3,9.32,1,0.85
128,319,112,3,2.5,2,8.71,1,0.78
129,326,112,3,3.5,3,9.1,1,0.84
130,333,118,5,5,5,9.35,1,0.92
131,339,114,5,4,4.5,9.76,1,0.96
132,303,105,5,5,4.5,8.65,0,0.77
133,309,105,5,3.5,3.5,8.56,0,0.71
134,323,112,5,4,4.5,8.78,0,0.79
135,333,113,5,4,4,9.28,1,0.89
136,314,109,4,3.5,4,8.77,1,0.82
137,312,103,3,5,4,8.45,0,0.76
138,316,100,2,1.5,3,8.16,1,0.71
139,326,116,2,4.5,3,9.08,1,0.8
140,318,109,1,3.5,3.5,9.12,0,0.78
141,329,110,2,4,3,9.15,1,0.84
142,332,118,2,4.5,3.5,9.36,1,0.9
143,331,115,5,4,3.5,9.44,1,0.92
144,340,120,4,4.5,4,9.92,1,0.97
145,325,112,2,3,3.5,8.96,1,0.8
146,320,113,2,2,2.5,8.64,1,0.81
147,315,105,3,2,2.5,8.48,0,0.75
148,326,114,3,3,3,9.11,1,0.83
149,339,116,4,4,3.5,9.8,1,0.96
150,311,106,2,3.5,3,8.26,1,0.79
151,334,114,4,4,4,9.43,1,0.93
152,332,116,5,5,5,9.28,1,0.94
153,321,112,5,5,5,9.06,1,0.86
154,324,105,3,3,4,8.75,0,0.79
155,326,108,3,3,3.5,8.89,0,0.8
156,312,109,3,3,3,8.69,0,0.77
157,315,105,3,2,2.5,8.34,0,0.7
158,309,104,2,2,2.5,8.26,0,0.65
159,306,106,2,2,2.5,8.14,0,0.61
160,297,100,1,1.5,2,7.9,0,0.52
161,315,103,1,1.5,2,7.86,0,0.57
162,298,99,1,1.5,3,7.46,0,0.53
163,318,109,3,3,3,8.5,0,0.67
164,317,105,3,3.5,3,8.56,0,0.68
165,329,111,4,4.5,4,9.01,1,0.81
166,322,110,5,4.5,4,8.97,0,0.78
167,302,102,3,3.5,5,8.33,0,0.65
168,313,102,3,2,3,8.27,0,0.64
169,293,97,2,2,4,7.8,1,0.64
170,311,99,2,2.5,3,7.98,0,0.65
171,312,101,2,2.5,3.5,8.04,1,0.68
172,334,117,5,4,4.5,9.07,1,0.89
173,322,110,4,4,5,9.13,1,0.86
174,323,113,4,4,4.5,9.23,1,0.89
175,321,111,4,4,4,8.97,1,0.87
176,320,111,4,4.5,3.5,8.87,1,0.85
177,329,119,4,4.5,4.5,9.16,1,0.9
178,319,110,3,3.5,3.5,9.04,0,0.82
179,309,108,3,2.5,3,8.12,0,0.72
180,307,102,3,3,3,8.27,0,0.73
181,300,104,3,3.5,3,8.16,0,0.71
182,305,107,2,2.5,2.5,8.42,0,0.71
183,299,100,2,3,3.5,7.88,0,0.68
184,314,110,3,4,4,8.8,0,0.75
185,316,106,2,2.5,4,8.32,0,0.72
186,327,113,4,4.5,4.5,9.11,1,0.89
187,317,107,3,3.5,3,8.68,1,0.84
188,335,118,5,4.5,3.5,9.44,1,0.93
189,331,115,5,4.5,3.5,9.36,1,0.93
190,324,112,5,5,5,9.08,1,0.88
191,324,111,5,4.5,4,9.16,1,0.9
192,323,110,5,4,5,8.98,1,0.87
193,322,114,5,4.5,4,8.94,1,0.86
194,336,118,5,4.5,5,9.53,1,0.94
195,316,109,3,3.5,3,8.76,0,0.77
196,307,107,2,3,3.5,8.52,1,0.78
197,306,105,2,3,2.5,8.26,0,0.73
198,310,106,2,3.5,2.5,8.33,0,0.73
199,311,104,3,4.5,4.5,8.43,0,0.7
200,313,107,3,4,4.5,8.69,0,0.72
201,317,103,3,2.5,3,8.54,1,0.73
202,315,110,2,3.5,3,8.46,1,0.72
203,340,120,5,4.5,4.5,9.91,1,0.97
204,334,120,5,4,5,9.87,1,0.97
205,298,105,3,3.5,4,8.54,0,0.69
206,295,99,2,2.5,3,7.65,0,0.57
207,315,99,2,3.5,3,7.89,0,0.63
208,310,102,3,3.5,4,8.02,1,0.66
209,305,106,2,3,3,8.16,0,0.64
210,301,104,3,3.5,4,8.12,1,0.68
211,325,108,4,4.5,4,9.06,1,0.79
212,328,110,4,5,4,9.14,1,0.82
213,338,120,4,5,5,9.66,1,0.95
214,333,119,5,5,4.5,9.78,1,0.96
215,331,117,4,4.5,5,9.42,1,0.94
216,330,116,5,5,4.5,9.36,1,0.93
217,322,112,4,4.5,4.5,9.26,1,0.91
218,321,109,4,4,4,9.13,1,0.85
219,324,110,4,3,3.5,8.97,1,0.84
220,312,104,3,3.5,3.5,8.42,0,0.74
221,313,103,3,4,4,8.75,0,0.76
222,316,110,3,3.5,4,8.56,0,0.75
223,324,113,4,4.5,4,8.79,0,0.76
224,308,109,2,3,4,8.45,0,0.71
225,305,105,2,3,2,8.23,0,0.67
226,296,99,2,2.5,2.5,8.03,0,0.61
227,306,110,2,3.5,4,8.45,0,0.63
228,312,110,2,3.5,3,8.53,0,0.64
229,318,112,3,4,3.5,8.67,0,0.71
230,324,111,4,3,3,9.01,1,0.82
231,313,104,3,4,4.5,8.65,0,0.73
232,319,106,3,3.5,2.5,8.33,1,0.74
233,312,107,2,2.5,3.5,8.27,0,0.69
234,304,100,2,2.5,3.5,8.07,0,0.64
235,330,113,5,5,4,9.31,1,0.91
236,326,111,5,4.5,4,9.23,1,0.88
237,325,112,4,4,4.5,9.17,1,0.85
238,329,114,5,4.5,5,9.19,1,0.86
239,310,104,3,2,3.5,8.37,0,0.7
240,299,100,1,1.5,2,7.89,0,0.59
241,296,101,1,2.5,3,7.68,0,0.6
242,317,103,2,2.5,2,8.15,0,0.65
243,324,115,3,3.5,3,8.76,1,0.7
244,325,114,3,3.5,3,9.04,1,0.76
245,314,107,2,2.5,4,8.56,0,0.63
246,328,110,4,4,2.5,9.02,1,0.81
247,316,105,3,3,3.5,8.73,0,0.72
248,311,104,2,2.5,3.5,8.48,0,0.71
249,324,110,3,3.5,4,8.87,1,0.8
250,321,111,3,3.5,4,8.83,1,0.77
251,320,104,3,3,2.5,8.57,1,0.74
252,316,99,2,2.5,3,9,0,0.7
253,318,100,2,2.5,3.5,8.54,1,0.71
254,335,115,4,4.5,4.5,9.68,1,0.93
255,321,114,4,4,5,9.12,0,0.85
256,307,110,4,4,4.5,8.37,0,0.79
257,309,99,3,4,4,8.56,0,0.76
258,324,100,3,4,5,8.64,1,0.78
259,326,102,4,5,5,8.76,1,0.77
260,331,119,4,5,4.5,9.34,1,0.9
261,327,108,5,5,3.5,9.13,1,0.87
262,312,104,3,3.5,4,8.09,0,0.71
263,308,103,2,2.5,4,8.36,1,0.7
264,324,111,3,2.5,1.5,8.79,1,0.7
265,325,110,2,3,2.5,8.76,1,0.75
266,313,102,3,2.5,2.5,8.68,0,0.71
267,312,105,2,2,2.5,8.45,0,0.72
268,314,107,3,3,3.5,8.17,1,0.73
269,327,113,4,4.5,5,9.14,0,0.83
270,308,108,4,4.5,5,8.34,0,0.77
271,306,105,2,2.5,3,8.22,1,0.72
272,299,96,2,1.5,2,7.86,0,0.54
273,294,95,1,1.5,1.5,7.64,0,0.49
274,312,99,1,1,1.5,8.01,1,0.52
275,315,100,1,2,2.5,7.95,0,0.58
276,322,110,3,3.5,3,8.96,1,0.78
277,329,113,5,5,4.5,9.45,1,0.89
278,320,101,2,2.5,3,8.62,0,0.7
279,308,103,2,3,3.5,8.49,0,0.66
280,304,102,2,3,4,8.73,0,0.67
281,311,102,3,4.5,4,8.64,1,0.68
282,317,110,3,4,4.5,9.11,1,0.8
283,312,106,3,4,3.5,8.79,1,0.81
284,321,111,3,2.5,3,8.9,1,0.8
285,340,112,4,5,4.5,9.66,1,0.94
286,331,116,5,4,4,9.26,1,0.93
287,336,118,5,4.5,4,9.19,1,0.92
288,324,114,5,5,4.5,9.08,1,0.89
289,314,104,4,5,5,9.02,0,0.82
290,313,109,3,4,3.5,9,0,0.79
291,307,105,2,2.5,3,7.65,0,0.58
292,300,102,2,1.5,2,7.87,0,0.56
293,302,99,2,1,2,7.97,0,0.56
294,312,98,1,3.5,3,8.18,1,0.64
295,316,101,2,2.5,2,8.32,1,0.61
296,317,100,2,3,2.5,8.57,0,0.68
297,310,107,3,3.5,3.5,8.67,0,0.76
298,320,120,3,4,4.5,9.11,0,0.86
299,330,114,3,4.5,4.5,9.24,1,0.9
300,305,112,3,3,3.5,8.65,0,0.71
301,309,106,2,2.5,2.5,8,0,0.62
302,319,108,2,2.5,3,8.76,0,0.66
303,322,105,2,3,3,8.45,1,0.65
304,323,107,3,3.5,3.5,8.55,1,0.73
305,313,106,2,2.5,2,8.43,0,0.62
306,321,109,3,3.5,3.5,8.8,1,0.74
307,323,110,3,4,3.5,9.1,1,0.79
308,325,112,4,4,4,9,1,0.8
309,312,108,3,3.5,3,8.53,0,0.69
310,308,110,4,3.5,3,8.6,0,0.7
311,320,104,3,3,3.5,8.74,1,0.76
312,328,108,4,4.5,4,9.18,1,0.84
313,311,107,4,4.5,4.5,9,1,0.78
314,301,100,3,3.5,3,8.04,0,0.67
315,305,105,2,3,4,8.13,0,0.66
316,308,104,2,2.5,3,8.07,0,0.65
317,298,101,2,1.5,2,7.86,0,0.54
318,300,99,1,1,2.5,8.01,0,0.58
319,324,111,3,2.5,2,8.8,1,0.79
320,327,113,4,3.5,3,8.69,1,0.8
321,317,106,3,4,3.5,8.5,1,0.75
322,323,104,3,4,4,8.44,1,0.73
323,314,107,2,2.5,4,8.27,0,0.72
324,305,102,2,2,2.5,8.18,0,0.62
325,315,104,3,3,2.5,8.33,0,0.67
326,326,116,3,3.5,4,9.14,1,0.81
327,299,100,3,2,2,8.02,0,0.63
328,295,101,2,2.5,2,7.86,0,0.69
329,324,112,4,4,3.5,8.77,1,0.8
330,297,96,2,2.5,1.5,7.89,0,0.43
331,327,113,3,3.5,3,8.66,1,0.8
332,311,105,2,3,2,8.12,1,0.73
333,308,106,3,3.5,2.5,8.21,1,0.75
334,319,108,3,3,3.5,8.54,1,0.71
335,312,107,4,4.5,4,8.65,1,0.73
336,325,111,4,4,4.5,9.11,1,0.83
337,319,110,3,3,2.5,8.79,0,0.72
338,332,118,5,5,5,9.47,1,0.94
339,323,108,5,4,4,8.74,1,0.81
340,324,107,5,3.5,4,8.66,1,0.81
341,312,107,3,3,3,8.46,1,0.75
342,326,110,3,3.5,3.5,8.76,1,0.79
343,308,106,3,3,3,8.24,0,0.58
344,305,103,2,2.5,3.5,8.13,0,0.59
345,295,96,2,1.5,2,7.34,0,0.47
346,316,98,1,1.5,2,7.43,0,0.49
347,304,97,2,1.5,2,7.64,0,0.47
348,299,94,1,1,1,7.34,0,0.42
349,302,99,1,2,2,7.25,0,0.57
350,313,101,3,2.5,3,8.04,0,0.62
351,318,107,3,3,3.5,8.27,1,0.74
352,325,110,4,3.5,4,8.67,1,0.73
353,303,100,2,3,3.5,8.06,1,0.64
354,300,102,3,3.5,2.5,8.17,0,0.63
355,297,98,2,2.5,3,7.67,0,0.59
356,317,106,2,2,3.5,8.12,0,0.73
357,327,109,3,3.5,4,8.77,1,0.79
358,301,104,2,3.5,3.5,7.89,1,0.68
359,314,105,2,2.5,2,7.64,0,0.7
360,321,107,2,2,1.5,8.44,0,0.81
361,322,110,3,4,5,8.64,1,0.85
362,334,116,4,4,3.5,9.54,1,0.93
363,338,115,5,4.5,5,9.23,1,0.91
364,306,103,2,2.5,3,8.36,0,0.69
365,313,102,3,3.5,4,8.9,1,0.77
366,330,114,4,4.5,3,9.17,1,0.86
367,320,104,3,3.5,4.5,8.34,1,0.74
368,311,98,1,1,2.5,7.46,0,0.57
369,298,92,1,2,2,7.88,0,0.51
370,301,98,1,2,3,8.03,1,0.67
371,310,103,2,2.5,2.5,8.24,0,0.72
372,324,110,3,3.5,3,9.22,1,0.89
373,336,119,4,4.5,4,9.62,1,0.95
374,321,109,3,3,3,8.54,1,0.79
375,315,105,2,2,2.5,7.65,0,0.39
376,304,101,2,2,2.5,7.66,0,0.38
377,297,96,2,2.5,2,7.43,0,0.34
378,290,100,1,1.5,2,7.56,0,0.47
379,303,98,1,2,2.5,7.65,0,0.56
380,311,99,1,2.5,3,8.43,1,0.71
381,322,104,3,3.5,4,8.84,1,0.78
382,319,105,3,3,3.5,8.67,1,0.73
383,324,110,4,4.5,4,9.15,1,0.82
384,300,100,3,3,3.5,8.26,0,0.62
385,340,113,4,5,5,9.74,1,0.96
386,335,117,5,5,5,9.82,1,0.96
387,302,101,2,2.5,3.5,7.96,0,0.46
388,307,105,2,2,3.5,8.1,0,0.53
389,296,97,2,1.5,2,7.8,0,0.49
390,320,108,3,3.5,4,8.44,1,0.76
391,314,102,2,2,2.5,8.24,0,0.64
392,318,106,3,2,3,8.65,0,0.71
393,326,112,4,4,3.5,9.12,1,0.84
394,317,104,2,3,3,8.76,0,0.77
395,329,111,4,4.5,4,9.23,1,0.89
396,324,110,3,3.5,3.5,9.04,1,0.82
397,325,107,3,3,3.5,9.11,1,0.84
398,330,116,4,5,4.5,9.45,1,0.91
399,312,103,3,3.5,4,8.78,0,0.67
400,333,117,4,5,4,9.66,1,0.95

In [805]:
import pandas as pd

df = pd.read_csv('../Datasets/Admission_Predict.csv')
df.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [808]:
df = pd.read_csv('../Datasets/Admission_Predict.csv', index_col = 'Serial No.')
df.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [820]:
new_df = df.rename(columns = {'GRE Score': 'GRE Score',
                              'TOEFL Score':'TOEFL Score',
                              'University Rating': 'University Rating',
                              'SOP' : 'Statement of Purpose',
                              'LOR': 'Letter of Recomendation',
                              'Research':'Research',
                              'Chance of Admit': 'Chance of Admit'
                            }
)
new_df.head()

,GRE Score,TOEFL Score,University Rating,Statement of Purpose,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [821]:
new_df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'Statement of Purpose',
       'LOR ', 'CGPA', 'Research', 'Chance of Admit '],
      dtype='object')

In [822]:
new_df = new_df.rename(columns = {'LOR ': 'Letter of Recomendation'
                            }
)
new_df.head()

,GRE Score,TOEFL Score,University Rating,Statement of Purpose,Letter of Recomendation,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [823]:
new_df = new_df.rename(mapper = str.strip, axis = 'columns')
new_df.head()

,GRE Score,TOEFL Score,University Rating,Statement of Purpose,Letter of Recomendation,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [829]:
cols = list(df.columns)
columns = [col.lower() for col in cols]

df.columns = columns
df.head()
df.columns

Index(['gre score', 'toefl score', 'university rating', 'sop', 'lor ', 'cgpa',
       'research', 'chance of admit '],
      dtype='object')

In [831]:
cols = list(df.columns)
columns = [col.lower().strip() for col in cols]

df.columns = columns
df.head()
df.columns

Index(['gre score', 'toefl score', 'university rating', 'sop', 'lor', 'cgpa',
       'research', 'chance of admit'],
      dtype='object')

In [7]:
## boolean masking
import pandas as pd

df = pd.read_csv('../Datasets/Admission_Predict.csv', index_col=0) # Serial No. is the index
df.columns = [column.lower().strip() for column in df.columns]
df.head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [8]:
admit_mask = df['chance of admit'] > 0.7
admit_mask ## this is a boolean mask

Serial No.
1       True
2       True
3       True
4       True
5      False
       ...
396     True
397     True
398     True
399    False
400     True
Name: chance of admit, Length: 400, dtype: bool

In [9]:
df.where(admit_mask).head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
2,324.0,107.0,4.0,4.0,4.5,8.87,1.0,0.76
3,316.0,104.0,3.0,3.0,3.5,8.00,1.0,0.72
4,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
df.where(admit_mask).dropna().head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
2,324.0,107.0,4.0,4.0,4.5,8.87,1.0,0.76
3,316.0,104.0,3.0,3.0,3.5,8.00,1.0,0.72
4,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80
6,330.0,115.0,5.0,4.5,3.0,9.34,1.0,0.90

In [12]:
df[df['chance of admit'] > 0.7].head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
6,330,115,5,4.5,3.0,9.34,1,0.90

In [14]:
df['gre score'].head()

Serial No.
1    337
2    324
3    316
4    322
5    314
Name: gre score, dtype: int64

In [15]:
type(df['gre score'].head())

pandas.core.series.Series

In [16]:
df[['gre score', 'toefl score']].head()

            gre score  toefl score
Serial No.
1                 337          118
2                 324          107
3                 316          104
4                 322          110
5                 314          103

In [17]:
df[df['gre score']>320].head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
4,322,110,3,3.5,2.5,8.67,1,0.80
6,330,115,5,4.5,3.0,9.34,1,0.90
7,321,109,3,3.0,4.0,8.20,1,0.75

In [22]:
(df['chance of admit'] > 0.7) & (df['gre score']>320)
# we need the parenthesis

Serial No.
1       True
2       True
3      False
4       True
5      False
       ...
396     True
397     True
398     True
399    False
400     True
Length: 400, dtype: bool

In [23]:
df['chance of admit'].gt(0.7) & df['gre score'].lt(0.9)

Serial No.
1      False
2      False
3      False
4      False
5      False
       ...
396    False
397    False
398    False
399    False
400    False
Length: 400, dtype: bool

In [25]:
df['chance of admit'].gt(0.7).lt(0.9) # another way

Serial No.
1      False
2      False
3      False
4      False
5       True
       ...
396    False
397    False
398    False
399     True
400    False
Name: chance of admit, Length: 400, dtype: bool

In [34]:
# indexing dataframes
import pandas as pd

df = pd.read_csv('../Datasets/Admission_Predict.csv', index_col=0)
df.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [35]:
df.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            391, 392, 393, 394, 395, 396, 397, 398, 399, 400],
           dtype='int64', name='Serial No.', length=400)

In [36]:
df['Serial Number'] = df.index

In [37]:
df.columns = [column.strip() for column in df.columns]

In [38]:
df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'SOP', 'LOR', 'CGPA',
       'Research', 'Chance of Admit', 'Serial Number'],
      dtype='object')

In [39]:
df = df.set_index('Chance of Admit')

In [40]:
df.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Serial Number
Chance of Admit,,,,,,,,
0.92,337,118,4,4.5,4.5,9.65,1,1
0.76,324,107,4,4.0,4.5,8.87,1,2
0.72,316,104,3,3.0,3.5,8.00,1,3
0.80,322,110,3,3.5,2.5,8.67,1,4
0.65,314,103,2,2.0,3.0,8.21,0,5

In [42]:
df = df.reset_index()
df.head()

,index,Chance of Admit,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Serial Number
0,0,0.92,337,118,4,4.5,4.5,9.65,1,1
1,1,0.76,324,107,4,4.0,4.5,8.87,1,2
2,2,0.72,316,104,3,3.0,3.5,8.00,1,3
3,3,0.80,322,110,3,3.5,2.5,8.67,1,4
4,4,0.65,314,103,2,2.0,3.0,8.21,0,5

In [47]:
# multilevel index
df = pd.read_csv('../Datasets/census.csv')
df.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
0,40,3,6,1,0,Alabama,Alabama,4779736,4780127,4785161,...,0.002295,-0.193196,0.381066,0.582002,-0.467369,1.030015,0.826644,1.383282,1.724718,0.712594
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861

In [48]:
df['SUMLEV'].unique()

array([40, 50])

In [49]:
df = df[df['SUMLEV']==50]
df.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861
5,50,3,6,1,9,Alabama,Blount County,57322,57322,57373,...,1.807375,-1.177622,-1.748766,-2.062535,-1.369970,1.859511,-0.848580,-1.402476,-1.577232,-0.884411

In [51]:
columns_to_keep= ['STNAME', 'CTYNAME', 'BIRTHS2011', 'BIRTHS2012', 'BIRTHS2013', 'BIRTHS2014','BIRTHS2015', 'POPESTIMATE2011', 'POPESTIMATE2012', 'POPESTIMATE2013','POPESTIMATE2014', 'POPESTIMATE2015']

In [52]:
df= df[columns_to_keep]
df.head()

,STNAME,CTYNAME,BIRTHS2011,BIRTHS2012,BIRTHS2013,BIRTHS2014,BIRTHS2015,POPESTIMATE2011,POPESTIMATE2012,POPESTIMATE2013,POPESTIMATE2014,POPESTIMATE2015
1,Alabama,Autauga County,636,615,574,623,600,55253,55175,55038,55290,55347
2,Alabama,Baldwin County,2187,2092,2160,2186,2240,186659,190396,195126,199713,203709
3,Alabama,Barbour County,335,300,283,260,269,27226,27159,26973,26815,26489
4,Alabama,Bibb County,266,245,259,247,253,22733,22642,22512,22549,22583
5,Alabama,Blount County,744,710,646,618,603,57711,57776,57734,57658,57673

In [53]:
df = df.set_index(['STNAME', 'CTYNAME'])
df.head()

                        BIRTHS2011  BIRTHS2012  BIRTHS2013  BIRTHS2014  \
STNAME  CTYNAME
Alabama Autauga County         636         615         574         623
        Baldwin County        2187        2092        2160        2186
        Barbour County         335         300         283         260
        Bibb County            266         245         259         247
        Blount County          744         710         646         618

                        BIRTHS2015  POPESTIMATE2011  POPESTIMATE2012  \
STNAME  CTYNAME
Alabama Autauga County         600            55253            55175
        Baldwin County        2240           186659           190396
        Barbour County         269            27226            27159
        Bibb County            253            22733            22642
        Blount County          603            57711            57776

                        POPESTIMATE2013  POPESTIMATE2014  POPESTIMATE2015
STNAME  CTYNAME
Alabama Autauga County            55038            55290            55347
        Baldwin County           195126           199713           203709
        Barbour County            26973            26815            26489
        Bibb County               22512            22549            22583
        Blount County             57734            57658            57673

In [59]:
df.loc['Michigan', 'Washtenaw County']

BIRTHS2011           3826
BIRTHS2012           3780
BIRTHS2013           3662
BIRTHS2014           3683
BIRTHS2015           3709
POPESTIMATE2011    349048
POPESTIMATE2012    351213
POPESTIMATE2013    354289
POPESTIMATE2014    357029
POPESTIMATE2015    358880
Name: (Michigan, Washtenaw County), dtype: int64

In [61]:
type(df.loc['Michigan', 'Washtenaw County'])

pandas.core.series.Series

In [62]:
df.loc[[('Michigan', 'Washtenaw County'),
        ('Michigan', 'Wayne County')]]

                           BIRTHS2011  BIRTHS2012  BIRTHS2013  BIRTHS2014  \
STNAME   CTYNAME
Michigan Washtenaw County        3826        3780        3662        3683
         Wayne County           23819       23270       23377       23607

                           BIRTHS2015  POPESTIMATE2011  POPESTIMATE2012  \
STNAME   CTYNAME
Michigan Washtenaw County        3709           349048           351213
         Wayne County           23586          1801273          1792514

                           POPESTIMATE2013  POPESTIMATE2014  POPESTIMATE2015
STNAME   CTYNAME
Michigan Washtenaw County           354289           357029           358880
         Wayne County              1775713          1766008          1759335

In [63]:
## Missing Values
import pandas as pd

In [65]:
# NaN, NULL, None, or N/A
df = pd.read_csv('../Datasets/class_grades.csv')
df.head()

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17      NaN     63.15  48.89
3       7         NaN       NaN    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89

In [69]:
mask = df.isnull()
mask.head()

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0   False       False     False    False     False  False
1   False       False     False    False     False  False
2   False       False     False     True     False  False
3   False        True      True    False     False  False
4   False       False     False    False     False  False

In [72]:
# drop nas
df.dropna().head()

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
4       8       91.32     93.64    95.00    107.41  73.89
5       7       95.00     92.58    93.12     97.78  68.06
6       8       95.05    102.99    56.25     99.07  50.00

In [73]:
df.fillna(0, inplace=True)
df.head()

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17     0.00     63.15  48.89
3       7        0.00      0.00    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89

In [75]:
df = pd.read_csv('../Datasets/log.csv')
df.head(10)

         time    user       video  playback position paused  volume
0  1469974424  cheryl  intro.html                  5  False    10.0
1  1469974454  cheryl  intro.html                  6    NaN     NaN
2  1469974544  cheryl  intro.html                  9    NaN     NaN
3  1469974574  cheryl  intro.html                 10    NaN     NaN
4  1469977514     bob  intro.html                  1    NaN     NaN
5  1469977544     bob  intro.html                  1    NaN     NaN
6  1469977574     bob  intro.html                  1    NaN     NaN
7  1469977604     bob  intro.html                  1    NaN     NaN
8  1469974604  cheryl  intro.html                 11    NaN     NaN
9  1469974694  cheryl  intro.html                 14    NaN     NaN

In [76]:
#bfill, ffill
df.set_index('time', inplace=True)
df.sort_index(inplace = True)
df.head(10)

              user          video  playback position paused  volume
time
1469974424  cheryl     intro.html                  5  False    10.0
1469974424     sue  advanced.html                 23  False    10.0
1469974454  cheryl     intro.html                  6    NaN     NaN
1469974454     sue  advanced.html                 24    NaN     NaN
1469974484  cheryl     intro.html                  7    NaN     NaN
1469974514  cheryl     intro.html                  8    NaN     NaN
1469974524     sue  advanced.html                 25    NaN     NaN
1469974544  cheryl     intro.html                  9    NaN     NaN
1469974554     sue  advanced.html                 26    NaN     NaN
1469974574  cheryl     intro.html                 10    NaN     NaN

In [79]:
df.reset_index(inplace = True)
df.set_index(['time', 'user'], inplace= True)
df.head(10)

                           video  playback position paused  volume
time       user
1469974424 cheryl     intro.html                  5  False    10.0
           sue     advanced.html                 23  False    10.0
1469974454 cheryl     intro.html                  6    NaN     NaN
           sue     advanced.html                 24    NaN     NaN
1469974484 cheryl     intro.html                  7    NaN     NaN
1469974514 cheryl     intro.html                  8    NaN     NaN
1469974524 sue     advanced.html                 25    NaN     NaN
1469974544 cheryl     intro.html                  9    NaN     NaN
1469974554 sue     advanced.html                 26    NaN     NaN
1469974574 cheryl     intro.html                 10    NaN     NaN

In [81]:
#ffill method
df.fillna(method='ffill', inplace = True)
df.head(10)

                           video  playback position  paused  volume
time       user
1469974424 cheryl     intro.html                  5   False    10.0
           sue     advanced.html                 23   False    10.0
1469974454 cheryl     intro.html                  6   False    10.0
           sue     advanced.html                 24   False    10.0
1469974484 cheryl     intro.html                  7   False    10.0
1469974514 cheryl     intro.html                  8   False    10.0
1469974524 sue     advanced.html                 25   False    10.0
1469974544 cheryl     intro.html                  9   False    10.0
1469974554 sue     advanced.html                 26   False    10.0
1469974574 cheryl     intro.html                 10   False    10.0

In [82]:
df = pd.DataFrame({
    'A': [1,1,2,3,4],
    'B': [3,6,3,8,9],
    'C': ['a','b','c','d', 'e']
})
df.head()

   A  B  C
0  1  3  a
1  1  6  b
2  2  3  c
3  3  8  d
4  4  9  e

In [83]:
df.replace(1, 100)

     A  B  C
0  100  3  a
1  100  6  b
2    2  3  c
3    3  8  d
4    4  9  e

In [84]:
df.replace([1, 3], [100, 300])

     A    B  C
0  100  300  a
1  100    6  b
2    2  300  c
3  300    8  d
4    4    9  e

In [87]:
# NaN, NULL, None, or N/A
df = pd.read_csv('../Datasets/log.csv')
df.head(10)

         time    user       video  playback position paused  volume
0  1469974424  cheryl  intro.html                  5  False    10.0
1  1469974454  cheryl  intro.html                  6    NaN     NaN
2  1469974544  cheryl  intro.html                  9    NaN     NaN
3  1469974574  cheryl  intro.html                 10    NaN     NaN
4  1469977514     bob  intro.html                  1    NaN     NaN
5  1469977544     bob  intro.html                  1    NaN     NaN
6  1469977574     bob  intro.html                  1    NaN     NaN
7  1469977604     bob  intro.html                  1    NaN     NaN
8  1469974604  cheryl  intro.html                 11    NaN     NaN
9  1469974694  cheryl  intro.html                 14    NaN     NaN

In [88]:
df.replace(to_replace='.*.html$', value = 'webpage', regex=True)

          time    user    video  playback position paused  volume
0   1469974424  cheryl  webpage                  5  False    10.0
1   1469974454  cheryl  webpage                  6    NaN     NaN
2   1469974544  cheryl  webpage                  9    NaN     NaN
3   1469974574  cheryl  webpage                 10    NaN     NaN
4   1469977514     bob  webpage                  1    NaN     NaN
5   1469977544     bob  webpage                  1    NaN     NaN
6   1469977574     bob  webpage                  1    NaN     NaN
7   1469977604     bob  webpage                  1    NaN     NaN
8   1469974604  cheryl  webpage                 11    NaN     NaN
9   1469974694  cheryl  webpage                 14    NaN     NaN
10  1469974724  cheryl  webpage                 15    NaN     NaN
11  1469974454     sue  webpage                 24    NaN     NaN
12  1469974524     sue  webpage                 25    NaN     NaN
13  1469974424     sue  webpage                 23  False    10.0
14  1469974554     sue  webpage                 26    NaN     NaN
15  1469974624     sue  webpage                 27    NaN     NaN
16  1469974654     sue  webpage                 28    NaN     5.0
17  1469974724     sue  webpage                 29    NaN     NaN
18  1469974484  cheryl  webpage                  7    NaN     NaN
19  1469974514  cheryl  webpage                  8    NaN     NaN
20  1469974754     sue  webpage                 30    NaN     NaN
21  1469974824     sue  webpage                 31    NaN     NaN
22  1469974854     sue  webpage                 32    NaN     NaN
23  1469974924     sue  webpage                 33    NaN     NaN
24  1469977424     bob  webpage                  1   True    10.0
25  1469977454     bob  webpage                  1    NaN     NaN
26  1469977484     bob  webpage                  1    NaN     NaN
27  1469977634     bob  webpage                  1    NaN     NaN
28  1469977664     bob  webpage                  1    NaN     NaN
29  1469974634  cheryl  webpage                 12    NaN     NaN
30  1469974664  cheryl  webpage                 13    NaN     NaN
31  1469977694     bob  webpage                  1    NaN     NaN
32  1469977724     bob  webpage                  1    NaN     NaN

In [90]:
import pandas as pd
df = pd.read_csv('../Datasets/presidents.csv')
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days"
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days"
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days"
3,4,James Madison,"Mar 16, 1751[a]","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days"
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days"

In [91]:
df['First'] = df['President']
df['First'] = df['First'].replace('[ ].*', '', regex = True)
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age,First
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days",George
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days",John
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days",Thomas
3,4,James Madison,"Mar 16, 1751[a]","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days",James
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days",James

In [92]:
del(df['First'])

In [93]:
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days"
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days"
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days"
3,4,James Madison,"Mar 16, 1751[a]","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days"
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days"

In [94]:
def splitname(row):
    row['First'] = row['President'].split()[0]
    row['Last'] = row['President'].split()[-1]

    return row

df = df.apply(splitname, axis='columns')
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age,First,Last
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days",George,Washington
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days",John,Adams
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days",Thomas,Jefferson
3,4,James Madison,"Mar 16, 1751[a]","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days",James,Madison
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days",James,Monroe

In [95]:
del(df['First'])
del(df['Last'])

In [104]:
text = 'Eduardo Montero'
import re

re.findall('\w+', text)

['Eduardo', 'Montero']

In [110]:
pattern = '(^[\w]*)(?:.* )([\w]*$)'
df['President'].str.extract(pattern).head()

        0           1
0  George  Washington
1    John       Adams
2  Thomas   Jefferson
3   James     Madison
4   James      Monroe

In [117]:
#Groups using regex
pattern = '(?P<First>^[\w]*)(?:.* )(?P<Last>[\w]*$)'
names = df['President'].str.extract(pattern)
names.head()

    First        Last
0  George  Washington
1    John       Adams
2  Thomas   Jefferson
3   James     Madison
4   James      Monroe

In [118]:
df['First'] = names['First']
df['Last'] = names['Last']
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age,First,Last
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days",George,Washington
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days",John,Adams
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days",Thomas,Jefferson
3,4,James Madison,"Mar 16, 1751[a]","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days",James,Madison
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days",James,Monroe

In [127]:
text = 'Feb 22, 1732[a]'
re.findall('([\w]{3} [\w]{1,2}, [\w]{4})', text)

['Feb 22, 1732']

In [128]:
pattern = '([\w]{3} [\w]{1,2}, [\w]{4})'
df['Born'] = df['Born'].str.extract(pattern)
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age,First,Last
0,1,George Washington,"Feb 22, 1732","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days",George,Washington
1,2,John Adams,"Oct 30, 1735","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days",John,Adams
2,3,Thomas Jefferson,"Apr 13, 1743","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days",Thomas,Jefferson
3,4,James Madison,"Mar 16, 1751","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days",James,Madison
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days",James,Monroe

In [130]:
df['Born'] = pd.to_datetime(df['Born'])
df['Born'].head()

0   1732-02-22
1   1735-10-30
2   1743-04-13
3   1751-03-16
4   1758-04-28
Name: Born, dtype: datetime64[ns]

In [133]:
import pandas as pd
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj2

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [136]:
x = obj2['California']
obj2['California'] != x

True

In [141]:
dict = {'one': [0,4,8,12],
        'two': [1,5,9,13]
    }

df = pd.DataFrame(dict)

   one  two
0    0    1
1    4    5
2    8    9
3   12   13

In [143]:
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

2

In [145]:
import pandas as pd

data = {
  "firstname": ["Sally", "Mary", "John"],
  "age": [50, 40, 30]
}

df = pd.DataFrame(data, index=[6,8,10])

for x, y in df.iteritems():
  print(x)
  print(y)

firstname
6     Sally
8      Mary
10     John
Name: firstname, dtype: object
age
6     50
8     40
10    30
Name: age, dtype: int64

## Merging Dataframes

In [146]:
import pandas as pd

In [154]:
# creating a dataframe with a list of dictionaries
# there is one dictionary per record
staff_df = pd.DataFrame([{'name': 'Kelly', 'role': 'Director of HR'},
                        {'name': 'Sally', 'role': 'Course Liasion'},
                        {'name': 'James', 'role': 'Grader'}]
                    )
staff_df.set_index('name', inplace=True)

student_df = pd.DataFrame([
    {'name':'James', 'school': 'Business'},
    {'name':'Mike', 'school':'Law'},
    {'name':'Sally', 'school':'Engineering'}
])
student_df.set_index('name', inplace=True)

In [157]:
print(staff_df.head())
print(student_df.head())

                 role
name
Kelly  Director of HR
Sally  Course Liasion
James          Grader
            school
name
James     Business
Mike           Law
Sally  Engineering

In [158]:
pd.merge(staff_df, student_df, how='outer', left_index = True, right_index = True)

                 role       school
name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course Liasion  Engineering

In [159]:
pd.merge(staff_df, student_df, how='inner', left_index=True, right_index= True)

                 role       school
name
Sally  Course Liasion  Engineering
James          Grader     Business

In [160]:
pd.merge(staff_df, student_df, how='left', left_index=True, right_index = True)

                 role       school
name
Kelly  Director of HR          NaN
Sally  Course Liasion  Engineering
James          Grader     Business

In [161]:
pd.merge(staff_df, student_df, how='right', left_index=True, right_index = True)

                 role       school
name
James          Grader     Business
Mike              NaN          Law
Sally  Course Liasion  Engineering

In [163]:
staff_df.reset_index(inplace = True)
student_df.reset_index(inplace = True)

In [164]:
pd.merge(staff_df, student_df, how='right', on = 'name')

    name            role       school
0  James          Grader     Business
1   Mike             NaN          Law
2  Sally  Course Liasion  Engineering

In [165]:
# creating a dataframe with a list of dictionaries
# there is one dictionary per record
staff_df = pd.DataFrame([{'name': 'Kelly', 'role': 'Director of HR', 'location': 'State Street'},
                        {'name': 'Sally', 'role': 'Course Liasion', 'location': 'Washington Avenue'},
                        {'name': 'James', 'role': 'Grader', 'location': 'Washington Avenue'}]
                    )

student_df = pd.DataFrame([
    {'name':'James', 'school': 'Business', 'location':'102 Billy Street'},
    {'name':'Mike', 'school':'Law', 'location': 'Fraternity House #23'},
    {'name':'Sally', 'school':'Engineering', 'location': '512 Wilson Credest'}
])

In [166]:
pd.merge(staff_df, student_df, how = 'left', on ='name')

    name            role         location_x       school          location_y
0  Kelly  Director of HR       State Street          NaN                 NaN
1  Sally  Course Liasion  Washington Avenue  Engineering  512 Wilson Credest
2  James          Grader  Washington Avenue     Business    102 Billy Street

In [167]:
# creating a dataframe with a list of dictionaries
# there is one dictionary per record
staff_df = pd.DataFrame([{'name': 'Kelly', 'last_name':'Montero','role': 'Director of HR', 'location': 'State Street'},
                        {'name': 'Sally', 'last_name':'Bermudez', 'role': 'Course Liasion', 'location': 'Washington Avenue'},
                        {'name': 'James', 'last_name':'Perez', 'role': 'Grader', 'location': 'Washington Avenue'}]
                    )

student_df = pd.DataFrame([
    {'name':'James', 'last_name':'Montero', 'school': 'Business', 'location':'102 Billy Street'},
    {'name':'Mike', 'last_name':'Gonzales', 'school':'Law', 'location': 'Fraternity House #23'},
    {'name':'Sally', 'last_name':'Bermudez', 'school':'Engineering', 'location': '512 Wilson Credest'}
])

In [168]:
pd.merge(staff_df, student_df, how='inner', on =['name', 'last_name'])

,name,last_name,role,location_x,school,location_y
0,Sally,Bermudez,Course Liasion,Washington Avenue,Engineering,512 Wilson Credest

In [173]:
%%capture
## %%capture sirve para capturar los errores
df_2012 = pd.read_csv('../Datasets/MERGED2012_13_PP.csv', error_bad_lines = False)
df_2013 = pd.read_csv('../Datasets/MERGED2013_14_PP.csv', error_bad_lines = False)
df_2010 = pd.read_csv('../Datasets/MERGED2010_11_PP.csv', error_bad_lines = False)

In [179]:
print(len(df_2012))
print(len(df_2013))
print(len(df_2010))

7793
7804
7414

In [180]:
frames = [df_2012, df_2013, df_2010]
df3 = pd.concat(frames)
print(len(df3))

23011

In [181]:
len(df_2012) + len(df_2013) + len(df_2010)

23011

In [188]:
assert(len(df_2012) + len(df_2013) + len(df_2010) == len(df3))

In [184]:
df4 = pd.concat(frames, keys=[2012, 2013, 2010])
df4.head(9)

        UNITID    OPEID  OPEID6                               INSTNM  \
2012 0  100654   100200    1002             Alabama A & M University
     1  100663   105200    1052  University of Alabama at Birmingham
     2  100690  2503400   25034                   Amridge University
     3  100706   105500    1055  University of Alabama in Huntsville
     4  100724   100500    1005             Alabama State University
     5  100751   105100    1051            The University of Alabama
     6  100760   100700    1007    Central Alabama Community College
     7  100812   100800    1008              Athens State University
     8  100830   831000    8310      Auburn University at Montgomery

                  CITY STABBR         ZIP  ACCREDAGENCY  INSTURL  NPCURL  ...  \
2012 0          Normal     AL       35762           NaN      NaN     NaN  ...
     1      Birmingham     AL  35294-0110           NaN      NaN     NaN  ...
     2      Montgomery     AL  36117-3553           NaN      NaN     NaN  ...
     3      Huntsville     AL       35899           NaN      NaN     NaN  ...
     4      Montgomery     AL  36104-0271           NaN      NaN     NaN  ...
     5      Tuscaloosa     AL  35487-0166           NaN      NaN     NaN  ...
     6  Alexander City     AL       35010           NaN      NaN     NaN  ...
     7          Athens     AL       35611           NaN      NaN     NaN  ...
     8      Montgomery     AL  36117-3596           NaN      NaN     NaN  ...

        OMAWDP8_NOTFIRSTTIME_POOLED_SUPP  OMENRUP_NOTFIRSTTIME_POOLED_SUPP  \
2012 0                               NaN                               NaN
     1                               NaN                               NaN
     2                               NaN                               NaN
     3                               NaN                               NaN
     4                               NaN                               NaN
     5                               NaN                               NaN
     6                               NaN                               NaN
     7                               NaN                               NaN
     8                               NaN                               NaN

        OMENRYP_FULLTIME_POOLED_SUPP  OMENRAP_FULLTIME_POOLED_SUPP  \
2012 0                           NaN                           NaN
     1                           NaN                           NaN
     2                           NaN                           NaN
     3                           NaN                           NaN
     4                           NaN                           NaN
     5                           NaN                           NaN
     6                           NaN                           NaN
     7                           NaN                           NaN
     8                           NaN                           NaN

        OMAWDP8_FULLTIME_POOLED_SUPP  OMENRUP_FULLTIME_POOLED_SUPP  \
2012 0                           NaN                           NaN
     1                           NaN                           NaN
     2                           NaN                           NaN
     3                           NaN                           NaN
     4                           NaN                           NaN
     5                           NaN                           NaN
     6                           NaN                           NaN
     7                           NaN                           NaN
     8                           NaN                           NaN

        OMENRYP_PARTTIME_POOLED_SUPP  OMENRAP_PARTTIME_POOLED_SUPP  \
2012 0                           NaN                           NaN
     1                           NaN                           NaN
     2                           NaN                           NaN
     3                           NaN                           NaN
     4                           NaN                           NaN
     5                           NaN                           NaN
     6                           NaN                           NaN
     7                           NaN                           NaN
     8                           NaN                           NaN

        OMAWDP8_PARTTIME_POOLED_SUPP  OMENRUP_PARTTIME_POOLED_SUPP
2012 0                           NaN                           NaN
     1                           NaN                           NaN
     2                           NaN                           NaN
     3                           NaN                           NaN
     4                           NaN                           NaN
     5                           NaN                           NaN
     6                           NaN                           NaN
     7                           NaN                           NaN
     8                           NaN                           NaN

[9 rows x 1977 columns]

## Pandas Idioms

In [220]:
import pandas as pd
import numpy as np
import timeit

In [221]:
df = pd.read_csv('../Datasets/census.csv')
df.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
0,40,3,6,1,0,Alabama,Alabama,4779736,4780127,4785161,...,0.002295,-0.193196,0.381066,0.582002,-0.467369,1.030015,0.826644,1.383282,1.724718,0.712594
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861

In [191]:
## pandorable way to write code
(df.where(df['SUMLEV']==50)
    .dropna()
    .set_index(['STNAME', 'CTYNAME'])
    .rename(columns={'ESTIMATESBASE2010':'Estimates Base 2010'})
)

                           SUMLEV  REGION  DIVISION  STATE  COUNTY  \
STNAME  CTYNAME
Alabama Autauga County       50.0     3.0       6.0    1.0     1.0
        Baldwin County       50.0     3.0       6.0    1.0     3.0
        Barbour County       50.0     3.0       6.0    1.0     5.0
        Bibb County          50.0     3.0       6.0    1.0     7.0
        Blount County        50.0     3.0       6.0    1.0     9.0
...                           ...     ...       ...    ...     ...
Wyoming Sweetwater County    50.0     4.0       8.0   56.0    37.0
        Teton County         50.0     4.0       8.0   56.0    39.0
        Uinta County         50.0     4.0       8.0   56.0    41.0
        Washakie County      50.0     4.0       8.0   56.0    43.0
        Weston County        50.0     4.0       8.0   56.0    45.0

                           CENSUS2010POP  Estimates Base 2010  \
STNAME  CTYNAME
Alabama Autauga County           54571.0              54571.0
        Baldwin County          182265.0             182265.0
        Barbour County           27457.0              27457.0
        Bibb County              22915.0              22919.0
        Blount County            57322.0              57322.0
...                                  ...                  ...
Wyoming Sweetwater County        43806.0              43806.0
        Teton County             21294.0              21294.0
        Uinta County             21118.0              21118.0
        Washakie County           8533.0               8533.0
        Weston County             7208.0               7208.0

                           POPESTIMATE2010  POPESTIMATE2011  POPESTIMATE2012  \
STNAME  CTYNAME
Alabama Autauga County             54660.0          55253.0          55175.0
        Baldwin County            183193.0         186659.0         190396.0
        Barbour County             27341.0          27226.0          27159.0
        Bibb County                22861.0          22733.0          22642.0
        Blount County              57373.0          57711.0          57776.0
...                                    ...              ...              ...
Wyoming Sweetwater County          43593.0          44041.0          45104.0
        Teton County               21297.0          21482.0          21697.0
        Uinta County               21102.0          20912.0          20989.0
        Washakie County             8545.0           8469.0           8443.0
        Weston County               7181.0           7114.0           7065.0

                           ...  RDOMESTICMIG2011  RDOMESTICMIG2012  \
STNAME  CTYNAME            ...
Alabama Autauga County     ...          7.242091         -2.915927
        Baldwin County     ...         14.832960         17.647293
        Barbour County     ...         -4.728132         -2.500690
        Bibb County        ...         -5.527043         -5.068871
        Blount County      ...          1.807375         -1.177622
...                        ...               ...               ...
Wyoming Sweetwater County  ...          1.072643         16.243199
        Teton County       ...         -1.589565          0.972695
        Uinta County       ...        -17.755986         -4.916350
        Washakie County    ...        -11.637475         -0.827815
        Weston County      ...        -11.752361         -8.040059

                           RDOMESTICMIG2013  RDOMESTICMIG2014  \
STNAME  CTYNAME
Alabama Autauga County            -3.012349          2.265971
        Baldwin County            21.845705         19.243287
        Barbour County            -7.056824         -3.904217
        Bibb County               -6.201001         -0.177537
        Blount County             -1.748766         -2.062535
...                                     ...               ...
Wyoming Sweetwater County         -5.339774        -14.252889
        Teton County              19.525929         14.143021
        Uinta County              -6.902954        -14.215862
        Washakie County           -2.013502        -17.781491
        Weston County             12.372583          1.533635

                           RDOMESTICMIG2015  RNETMIG2011  RNETMIG2012  \
STNAME  CTYNAME
Alabama Autauga County            -2.530799     7.606016    -2.626146
        Baldwin County            17.197872    15.844176    18.559627
        Barbour County           -10.543299    -4.874741    -2.758113
        Bibb County                0.177258    -5.088389    -4.363636
        Blount County             -1.369970     1.859511    -0.848580
...                                     ...          ...          ...
Wyoming Sweetwater County        -14.248864     1.255221    16.243199
        Teton County              -0.564849     0.654527     2.408578
        Uinta County             -12.127022   -18.136812    -5.536861
        Washakie County            1.682288   -11.990126    -1.182592
        Weston County              6.935294   -12.032179    -8.040059

                           RNETMIG2013  RNETMIG2014  RNETMIG2015
STNAME  CTYNAME
Alabama Autauga County       -2.722002     2.592270    -2.187333
        Baldwin County       22.727626    20.317142    18.293499
        Barbour County       -7.167664    -3.978583   -10.543299
        Bibb County          -5.403729     0.754533     1.107861
        Blount County        -1.402476    -1.577232    -0.884411
...                                ...          ...          ...
Wyoming Sweetwater County    -5.295460   -14.075283   -14.070195
        Teton County         21.160658    16.308671     1.520747
        Uinta County         -7.521840   -14.740608   -12.606351
        Washakie County      -2.250385   -18.020168     1.441961
        Weston County        12.372583     1.533635     6.935294

[3142 rows x 98 columns]

In [193]:
# note pandorable way to write code
df = df[df['SUMLEV']==50]
df.set_index(['STNAME', 'CTYNAME'], inplace = True)
df.rename(columns ={'ESTIMATESBASE2010':'Estimates Base 2010'})

                           SUMLEV  REGION  DIVISION  STATE  COUNTY  \
STNAME  CTYNAME
Alabama Autauga County         50       3         6      1       1
        Baldwin County         50       3         6      1       3
        Barbour County         50       3         6      1       5
        Bibb County            50       3         6      1       7
        Blount County          50       3         6      1       9
...                           ...     ...       ...    ...     ...
Wyoming Sweetwater County      50       4         8     56      37
        Teton County           50       4         8     56      39
        Uinta County           50       4         8     56      41
        Washakie County        50       4         8     56      43
        Weston County          50       4         8     56      45

                           CENSUS2010POP  Estimates Base 2010  \
STNAME  CTYNAME
Alabama Autauga County             54571                54571
        Baldwin County            182265               182265
        Barbour County             27457                27457
        Bibb County                22915                22919
        Blount County              57322                57322
...                                  ...                  ...
Wyoming Sweetwater County          43806                43806
        Teton County               21294                21294
        Uinta County               21118                21118
        Washakie County             8533                 8533
        Weston County               7208                 7208

                           POPESTIMATE2010  POPESTIMATE2011  POPESTIMATE2012  \
STNAME  CTYNAME
Alabama Autauga County               54660            55253            55175
        Baldwin County              183193           186659           190396
        Barbour County               27341            27226            27159
        Bibb County                  22861            22733            22642
        Blount County                57373            57711            57776
...                                    ...              ...              ...
Wyoming Sweetwater County            43593            44041            45104
        Teton County                 21297            21482            21697
        Uinta County                 21102            20912            20989
        Washakie County               8545             8469             8443
        Weston County                 7181             7114             7065

                           ...  RDOMESTICMIG2011  RDOMESTICMIG2012  \
STNAME  CTYNAME            ...
Alabama Autauga County     ...          7.242091         -2.915927
        Baldwin County     ...         14.832960         17.647293
        Barbour County     ...         -4.728132         -2.500690
        Bibb County        ...         -5.527043         -5.068871
        Blount County      ...          1.807375         -1.177622
...                        ...               ...               ...
Wyoming Sweetwater County  ...          1.072643         16.243199
        Teton County       ...         -1.589565          0.972695
        Uinta County       ...        -17.755986         -4.916350
        Washakie County    ...        -11.637475         -0.827815
        Weston County      ...        -11.752361         -8.040059

                           RDOMESTICMIG2013  RDOMESTICMIG2014  \
STNAME  CTYNAME
Alabama Autauga County            -3.012349          2.265971
        Baldwin County            21.845705         19.243287
        Barbour County            -7.056824         -3.904217
        Bibb County               -6.201001         -0.177537
        Blount County             -1.748766         -2.062535
...                                     ...               ...
Wyoming Sweetwater County         -5.339774        -14.252889
        Teton County              19.525929         14.143021
        Uinta County              -6.902954        -14.215862
        Washakie County           -2.013502        -17.781491
        Weston County             12.372583          1.533635

                           RDOMESTICMIG2015  RNETMIG2011  RNETMIG2012  \
STNAME  CTYNAME
Alabama Autauga County            -2.530799     7.606016    -2.626146
        Baldwin County            17.197872    15.844176    18.559627
        Barbour County           -10.543299    -4.874741    -2.758113
        Bibb County                0.177258    -5.088389    -4.363636
        Blount County             -1.369970     1.859511    -0.848580
...                                     ...          ...          ...
Wyoming Sweetwater County        -14.248864     1.255221    16.243199
        Teton County              -0.564849     0.654527     2.408578
        Uinta County             -12.127022   -18.136812    -5.536861
        Washakie County            1.682288   -11.990126    -1.182592
        Weston County              6.935294   -12.032179    -8.040059

                           RNETMIG2013  RNETMIG2014  RNETMIG2015
STNAME  CTYNAME
Alabama Autauga County       -2.722002     2.592270    -2.187333
        Baldwin County       22.727626    20.317142    18.293499
        Barbour County       -7.167664    -3.978583   -10.543299
        Bibb County          -5.403729     0.754533     1.107861
        Blount County        -1.402476    -1.577232    -0.884411
...                                ...          ...          ...
Wyoming Sweetwater County    -5.295460   -14.075283   -14.070195
        Teton County         21.160658    16.308671     1.520747
        Uinta County         -7.521840   -14.740608   -12.606351
        Washakie County      -2.250385   -18.020168     1.441961
        Weston County        12.372583     1.533635     6.935294

[3142 rows x 98 columns]

In [205]:
def first_approach():
    global df
    return (df.where(df['SUMLEV']==50)
    .dropna()
    .set_index(['STNAME', 'CTYNAME'])
    .rename(columns={'ESTIMATESBASE2010':'Estimates Base 2010'})
    )   

df = pd.read_csv('../Datasets/census.csv')
timeit.timeit(first_approach, number=10)

0.23860728499857942

In [206]:
def second_approach():
    global df
    new_df = df[df['SUMLEV']==50]
    new_df.set_index(['STNAME', 'CTYNAME'], inplace = True)
    return new_df.rename(columns ={'ESTIMATESBASE2010':'Estimates Base 2010'})

df = pd.read_csv('../Datasets/census.csv')
timeit.timeit(second_approach, number=10)

0.0712937080024858

In [207]:
## pandas could have time issues

In [211]:
(
    df.where(df['SUMLEV']==50)
      .dropna()
      .set_index(['STATE', 'COUNTY'])
      .rename(columns={'CTYNAME':'City'})
)

              SUMLEV  REGION  DIVISION   STNAME               City  \
STATE COUNTY
1.0   1.0       50.0     3.0       6.0  Alabama     Autauga County
      3.0       50.0     3.0       6.0  Alabama     Baldwin County
      5.0       50.0     3.0       6.0  Alabama     Barbour County
      7.0       50.0     3.0       6.0  Alabama        Bibb County
      9.0       50.0     3.0       6.0  Alabama      Blount County
...              ...     ...       ...      ...                ...
56.0  37.0      50.0     4.0       8.0  Wyoming  Sweetwater County
      39.0      50.0     4.0       8.0  Wyoming       Teton County
      41.0      50.0     4.0       8.0  Wyoming       Uinta County
      43.0      50.0     4.0       8.0  Wyoming    Washakie County
      45.0      50.0     4.0       8.0  Wyoming      Weston County

              CENSUS2010POP  ESTIMATESBASE2010  POPESTIMATE2010  \
STATE COUNTY
1.0   1.0           54571.0            54571.0          54660.0
      3.0          182265.0           182265.0         183193.0
      5.0           27457.0            27457.0          27341.0
      7.0           22915.0            22919.0          22861.0
      9.0           57322.0            57322.0          57373.0
...                     ...                ...              ...
56.0  37.0          43806.0            43806.0          43593.0
      39.0          21294.0            21294.0          21297.0
      41.0          21118.0            21118.0          21102.0
      43.0           8533.0             8533.0           8545.0
      45.0           7208.0             7208.0           7181.0

              POPESTIMATE2011  POPESTIMATE2012  ...  RDOMESTICMIG2011  \
STATE COUNTY                                    ...
1.0   1.0             55253.0          55175.0  ...          7.242091
      3.0            186659.0         190396.0  ...         14.832960
      5.0             27226.0          27159.0  ...         -4.728132
      7.0             22733.0          22642.0  ...         -5.527043
      9.0             57711.0          57776.0  ...          1.807375
...                       ...              ...  ...               ...
56.0  37.0            44041.0          45104.0  ...          1.072643
      39.0            21482.0          21697.0  ...         -1.589565
      41.0            20912.0          20989.0  ...        -17.755986
      43.0             8469.0           8443.0  ...        -11.637475
      45.0             7114.0           7065.0  ...        -11.752361

              RDOMESTICMIG2012  RDOMESTICMIG2013  RDOMESTICMIG2014  \
STATE COUNTY
1.0   1.0            -2.915927         -3.012349          2.265971
      3.0            17.647293         21.845705         19.243287
      5.0            -2.500690         -7.056824         -3.904217
      7.0            -5.068871         -6.201001         -0.177537
      9.0            -1.177622         -1.748766         -2.062535
...                        ...               ...               ...
56.0  37.0           16.243199         -5.339774        -14.252889
      39.0            0.972695         19.525929         14.143021
      41.0           -4.916350         -6.902954        -14.215862
      43.0           -0.827815         -2.013502        -17.781491
      45.0           -8.040059         12.372583          1.533635

              RDOMESTICMIG2015  RNETMIG2011  RNETMIG2012  RNETMIG2013  \
STATE COUNTY
1.0   1.0            -2.530799     7.606016    -2.626146    -2.722002
      3.0            17.197872    15.844176    18.559627    22.727626
      5.0           -10.543299    -4.874741    -2.758113    -7.167664
      7.0             0.177258    -5.088389    -4.363636    -5.403729
      9.0            -1.369970     1.859511    -0.848580    -1.402476
...                        ...          ...          ...          ...
56.0  37.0          -14.248864     1.255221    16.243199    -5.295460
      39.0           -0.564849     0.654527     2.408578    21.160658
      41.0          -12.127022   -18.136812    -5.536861    -7.521840
      43.0            1.682288   -11.990126    -1.182592    -2.250385
      45.0            6.935294   -12.032179    -8.040059    12.372583

              RNETMIG2014  RNETMIG2015
STATE COUNTY
1.0   1.0        2.592270    -2.187333
      3.0       20.317142    18.293499
      5.0       -3.978583   -10.543299
      7.0        0.754533     1.107861
      9.0       -1.577232    -0.884411
...                   ...          ...
56.0  37.0     -14.075283   -14.070195
      39.0      16.308671     1.520747
      41.0     -14.740608   -12.606351
      43.0     -18.020168     1.441961
      45.0       1.533635     6.935294

[3142 rows x 98 columns]

In [212]:
# pandas idiom pandas chaining. Maybe has performance issues
# applymap

df = pd.DataFrame({'Nombre':['Eduardo', 'Jose', 'Lucrecia'],
                   'Apellido':['Montero','Bermudez', 'Lopez'] })
df

     Nombre  Apellido
0   Eduardo   Montero
1      Jose  Bermudez
2  Lucrecia     Lopez

In [213]:
df.applymap(lambda x: len(x))

   Nombre  Apellido
0       7         7
1       4         8
2       8         5

In [214]:
df.applymap(lambda x: x.upper())

     Nombre  Apellido
0   EDUARDO   MONTERO
1      JOSE  BERMUDEZ
2  LUCRECIA     LOPEZ

In [222]:
# applymap (todas las celdas)
# apply (rows)
def min_max(row):
    data = row[[
        'POPESTIMATE2010',
        'POPESTIMATE2011',
        'POPESTIMATE2012',
        'POPESTIMATE2013',
        'POPESTIMATE2014',
        'POPESTIMATE2015'
    ]]

    return pd.Series({'min':np.min(data) , 'max':np.max(data)})

df.apply(min_max, axis = 'columns').head()

       min      max
0  4785161  4858979
1    54660    55347
2   183193   203709
3    26489    27341
4    22512    22861

In [224]:
def min_max(row):
    data = row[[
        'POPESTIMATE2010',
        'POPESTIMATE2011',
        'POPESTIMATE2012',
        'POPESTIMATE2013',
        'POPESTIMATE2014',
        'POPESTIMATE2015'
    ]]

    row['max']= np.max(data)
    row['min']=np.min(data)

    return row

df.apply(min_max, axis = 'columns').head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015,max,min
0,40,3,6,1,0,Alabama,Alabama,4779736,4780127,4785161,...,0.381066,0.582002,-0.467369,1.030015,0.826644,1.383282,1.724718,0.712594,4858979,4785161
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333,55347,54660
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499,203709,183193
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299,27341,26489
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861,22861,22512

In [227]:
row=['POPESTIMATE2010','POPESTIMATE2011','POPESTIMATE2012','POPESTIMATE2013','POPESTIMATE2014','POPESTIMATE2015']
# calculo el máximo de las columnas en la lista rows para cada una de las filas
df.apply(lambda x:np.max(x[row]), axis='columns').head()
# lambda is an unnamed function in python

0    4858979
1      55347
2     203709
3      27341
4      22861
dtype: int64

In [234]:
def get_state_region(x):

    south = ['Alabama', 'Florida', 'Georgia']
    northeast=['Connecticut', 'Maine']

    if x in south:
        return 'South'
    elif x in northeast:
        return 'NorthEast'
#se aplica por fila axis=0 sobre la columna STNAME
df['STREGION'] = df['STNAME'].apply(lambda x: get_state_region(x))
df[['STREGION', 'STNAME']].head()

  STREGION   STNAME
0    South  Alabama
1    South  Alabama
2    South  Alabama
3    South  Alabama
4    South  Alabama

In [ ]:
# pandas idiom pandas chaining. and apply

## Splitting

In [235]:
import pandas as pd 
import numpy as np

In [237]:
df = pd.read_csv('../Datasets/census.csv')
df = df[df['SUMLEV']==50]

df.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861
5,50,3,6,1,9,Alabama,Blount County,57322,57322,57373,...,1.807375,-1.177622,-1.748766,-2.062535,-1.369970,1.859511,-0.848580,-1.402476,-1.577232,-0.884411

In [239]:
%%timeit -n 3
## run the cell 3 times and print the average time of execution
for state in df['STNAME'].unique():
    average = np.average(df.where(df['STNAME']==state).dropna()['CENSUS2010POP'])
    print(f'Countries in the state {state} has\
            the average population of {str(average)}')

Countries in the state Alabama has            the average population of 71339.34328358209
Countries in the state Alaska has            the average population of 24490.724137931036
Countries in the state Arizona has            the average population of 426134.4666666667
Countries in the state Arkansas has            the average population of 38878.90666666667
Countries in the state California has            the average population of 642309.5862068966
Countries in the state Colorado has            the average population of 78581.1875
Countries in the state Connecticut has            the average population of 446762.125
Countries in the state Delaware has            the average population of 299311.3333333333
Countries in the state District of Columbia has            the average population of 601723.0
Countries in the state Florida has            the average population of 280616.5671641791
Countries in the state Georgia has            the average population of 60928.63522012578
Countries in the state Hawaii has            the average population of 272060.2
Countries in the state Idaho has            the average population of 35626.86363636364
Countries in the state Illinois has            the average population of 125790.50980392157
Countries in the state Indiana has            the average population of 70476.10869565218
Countries in the state Iowa has            the average population of 30771.262626262625
Countries in the state Kansas has            the average population of 27172.55238095238
Countries in the state Kentucky has            the average population of 36161.39166666667
Countries in the state Louisiana has            the average population of 70833.9375
Countries in the state Maine has            the average population of 83022.5625
Countries in the state Maryland has            the average population of 240564.66666666666
Countries in the state Massachusetts has            the average population of 467687.78571428574
Countries in the state Michigan has            the average population of 119080.0
Countries in the state Minnesota has            the average population of 60964.65517241379
Countries in the state Mississippi has            the average population of 36186.54878048781
Countries in the state Missouri has            the average population of 52077.62608695652
Countries in the state Montana has            the average population of 17668.125
Countries in the state Nebraska has            the average population of 19638.075268817203
Countries in the state Nevada has            the average population of 158855.9411764706
Countries in the state New Hampshire has            the average population of 131647.0
Countries in the state New Jersey has            the average population of 418661.61904761905
Countries in the state New Mexico has            the average population of 62399.36363636364
Countries in the state New York has            the average population of 312550.03225806454
Countries in the state North Carolina has            the average population of 95354.83
Countries in the state North Dakota has            the average population of 12690.396226415094
Countries in the state Ohio has            the average population of 131096.63636363635
Countries in the state Oklahoma has            the average population of 48718.844155844155
Countries in the state Oregon has            the average population of 106418.72222222222
Countries in the state Pennsylvania has            the average population of 189587.74626865672
Countries in the state Rhode Island has            the average population of 210513.4
Countries in the state South Carolina has            the average population of 100551.39130434782
Countries in the state South Dakota has            the average population of 12336.060606060606
Countries in the state Tennessee has            the average population of 66801.1052631579
Countries in the state Texas has            the average population of 98998.27165354331
Countries in the state Utah has            the average population of 95306.37931034483
Countries in the state Vermont has            the average population of 44695.78571428572
Countries in the state Virginia has            the average population of 60111.29323308271
Countries in the state Washington has            the average population of 172424.10256410256
Countries in the state West Virginia has            the average population of 33690.8
Countries in the state Wisconsin has            the average population of 78985.91666666667
Countries in the state Wyoming has            the average population of 24505.478260869564
Countries in the state Alabama has            the average population of 71339.34328358209
Countries in the state Alaska has            the average population of 24490.724137931036
Countries in the state Arizona has            the average population of 426134.4666666667
Countries in the state Arkansas has            the average population of 38878.90666666667
Countries in the state California has            the average population of 642309.5862068966
Countries in the state Colorado has            the average population of 78581.1875
Countries in the state Connecticut has            the average population of 446762.125
Countries in the state Delaware has            the average population of 299311.3333333333
Countries in the state District of Columbia has            the average population of 601723.0
Countries in the state Florida has            the average population of 280616.5671641791
Countries in the state Georgia has            the average population of 60928.63522012578
Countries in the state Hawaii has            the average population of 272060.2
Countries in the state Idaho has            the average population of 35626.86363636364
Countries in the state Illinois has            the average population of 125790.50980392157
Countries in the state Indiana has            the average population of 70476.10869565218
Countries in the state Iowa has            the average population of 30771.262626262625
Countries in the state Kansas has            the average population of 27172.55238095238
Countries in the state Kentucky has            the average population of 36161.39166666667
Countries in the state Louisiana has            the average population of 70833.9375
Countries in the state Maine has            the average population of 83022.5625
Countries in the state Maryland has            the average population of 240564.66666666666
Countries in the state Massachusetts has            the average population of 467687.78571428574
Countries in the state Michigan has            the average population of 119080.0
Countries in the state Minnesota has            the average population of 60964.65517241379
Countries in the state Mississippi has            the average population of 36186.54878048781
Countries in the state Missouri has            the average population of 52077.62608695652
Countries in the state Montana has            the average population of 17668.125
Countries in the state Nebraska has            the average population of 19638.075268817203
Countries in the state Nevada has            the average population of 158855.9411764706
Countries in the state New Hampshire has            the average population of 131647.0
Countries in the state New Jersey has            the average population of 418661.61904761905
Countries in the state New Mexico has            the average population of 62399.36363636364
Countries in the state New York has            the average population of 312550.03225806454
Countries in the state North Carolina has            the average population of 95354.83
Countries in the state North Dakota has            the average population of 12690.396226415094
Countries in the state Ohio has            the average population of 131096.63636363635
Countries in the state Oklahoma has            the average population of 48718.844155844155
Countries in the state Oregon has            the average population of 106418.72222222222
Countries in the state Pennsylvania has            the average population of 189587.74626865672
Countries in the state Rhode Island has            the average population of 210513.4
Countries in the state South Carolina has            the average population of 100551.39130434782
Countries in the state South Dakota has            the average population of 12336.060606060606
Countries in the state Tennessee has            the average population of 66801.1052631579
Countries in the state Texas has            the average population of 98998.27165354331
Countries in the state Utah has            the average population of 95306.37931034483
Countries in the state Vermont has            the average population of 44695.78571428572
Countries in the state Virginia has            the average population of 60111.29323308271
Countries in the state Washington has            the average population of 172424.10256410256
Countries in the state West Virginia has            the average population of 33690.8
Countries in the state Wisconsin has            the average population of 78985.91666666667
Countries in the state Wyoming has            the average population of 24505.478260869564
Countries in the state Alabama has            the average population of 71339.34328358209
Countries in the state Alaska has            the average population of 24490.724137931036
Countries in the state Arizona has            the average population of 426134.4666666667
Countries in the state Arkansas has            the average population of 38878.90666666667
Countries in the state California has            the average population of 642309.5862068966
Countries in the state Colorado has            the average population of 78581.1875
Countries in the state Connecticut has            the average population of 446762.125
Countries in the state Delaware has            the average population of 299311.3333333333
Countries in the state District of Columbia has            the average population of 601723.0
Countries in the state Florida has            the average population of 280616.5671641791
Countries in the state Georgia has            the average population of 60928.63522012578
Countries in the state Hawaii has            the average population of 272060.2
Countries in the state Idaho has            the average population of 35626.86363636364
Countries in the state Illinois has            the average population of 125790.50980392157
Countries in the state Indiana has            the average population of 70476.10869565218
Countries in the state Iowa has            the average population of 30771.262626262625
Countries in the state Kansas has            the average population of 27172.55238095238
Countries in the state Kentucky has            the average population of 36161.39166666667
Countries in the state Louisiana has            the average population of 70833.9375
Countries in the state Maine has            the average population of 83022.5625
Countries in the state Maryland has            the average population of 240564.66666666666
Countries in the state Massachusetts has            the average population of 467687.78571428574
Countries in the state Michigan has            the average population of 119080.0
Countries in the state Minnesota has            the average population of 60964.65517241379
Countries in the state Mississippi has            the average population of 36186.54878048781
Countries in the state Missouri has            the average population of 52077.62608695652
Countries in the state Montana has            the average population of 17668.125
Countries in the state Nebraska has            the average population of 19638.075268817203
Countries in the state Nevada has            the average population of 158855.9411764706
Countries in the state New Hampshire has            the average population of 131647.0
Countries in the state New Jersey has            the average population of 418661.61904761905
Countries in the state New Mexico has            the average population of 62399.36363636364
Countries in the state New York has            the average population of 312550.03225806454
Countries in the state North Carolina has            the average population of 95354.83
Countries in the state North Dakota has            the average population of 12690.396226415094
Countries in the state Ohio has            the average population of 131096.63636363635
Countries in the state Oklahoma has            the average population of 48718.844155844155
Countries in the state Oregon has            the average population of 106418.72222222222
Countries in the state Pennsylvania has            the average population of 189587.74626865672
Countries in the state Rhode Island has            the average population of 210513.4
Countries in the state South Carolina has            the average population of 100551.39130434782
Countries in the state South Dakota has            the average population of 12336.060606060606
Countries in the state Tennessee has            the average population of 66801.1052631579
Countries in the state Texas has            the average population of 98998.27165354331
Countries in the state Utah has            the average population of 95306.37931034483
Countries in the state Vermont has            the average population of 44695.78571428572
Countries in the state Virginia has            the average population of 60111.29323308271
Countries in the state Washington has            the average population of 172424.10256410256
Countries in the state West Virginia has            the average population of 33690.8
Countries in the state Wisconsin has            the average population of 78985.91666666667
Countries in the state Wyoming has            the average population of 24505.478260869564
Countries in the state Alabama has            the average population of 71339.34328358209
Countries in the state Alaska has            the average population of 24490.724137931036
Countries in the state Arizona has            the average population of 426134.4666666667
Countries in the state Arkansas has            the average population of 38878.90666666667
Countries in the state California has            the average population of 642309.5862068966
Countries in the state Colorado has            the average population of 78581.1875
Countries in the state Connecticut has            the average population of 446762.125
Countries in the state Delaware has            the average population of 299311.3333333333
Countries in the state District of Columbia has            the average population of 601723.0
Countries in the state Florida has            the average population of 280616.5671641791
Countries in the state Georgia has            the average population of 60928.63522012578
Countries in the state Hawaii has            the average population of 272060.2
Countries in the state Idaho has            the average population of 35626.86363636364
Countries in the state Illinois has            the average population of 125790.50980392157
Countries in the state Indiana has            the average population of 70476.10869565218
Countries in the state Iowa has            the average population of 30771.262626262625
Countries in the state Kansas has            the average population of 27172.55238095238
Countries in the state Kentucky has            the average population of 36161.39166666667
Countries in the state Louisiana has            the average population of 70833.9375
Countries in the state Maine has            the average population of 83022.5625
Countries in the state Maryland has            the average population of 240564.66666666666
Countries in the state Massachusetts has            the average population of 467687.78571428574
Countries in the state Michigan has            the average population of 119080.0
Countries in the state Minnesota has            the average population of 60964.65517241379
Countries in the state Mississippi has            the average population of 36186.54878048781
Countries in the state Missouri has            the average population of 52077.62608695652
Countries in the state Montana has            the average population of 17668.125
Countries in the state Nebraska has            the average population of 19638.075268817203
Countries in the state Nevada has            the average population of 158855.9411764706
Countries in the state New Hampshire has            the average population of 131647.0
Countries in the state New Jersey has            the average population of 418661.61904761905
Countries in the state New Mexico has            the average population of 62399.36363636364
Countries in the state New York has            the average population of 312550.03225806454
Countries in the state North Carolina has            the average population of 95354.83
Countries in the state North Dakota has            the average population of 12690.396226415094
Countries in the state Ohio has            the average population of 131096.63636363635
Countries in the state Oklahoma has            the average population of 48718.844155844155
Countries in the state Oregon has            the average population of 106418.72222222222
Countries in the state Pennsylvania has            the average population of 189587.74626865672
Countries in the state Rhode Island has            the average population of 210513.4
Countries in the state South Carolina has            the average population of 100551.39130434782
Countries in the state South Dakota has            the average population of 12336.060606060606
Countries in the state Tennessee has            the average population of 66801.1052631579
Countries in the state Texas has            the average population of 98998.27165354331
Countries in the state Utah has            the average population of 95306.37931034483
Countries in the state Vermont has            the average population of 44695.78571428572
Countries in the state Virginia has            the average population of 60111.29323308271
Countries in the state Washington has            the average population of 172424.10256410256
Countries in the state West Virginia has            the average population of 33690.8
Countries in the state Wisconsin has            the average population of 78985.91666666667
Countries in the state Wyoming has            the average population of 24505.478260869564
Countries in the state Alabama has            the average population of 71339.34328358209
Countries in the state Alaska has            the average population of 24490.724137931036
Countries in the state Arizona has            the average population of 426134.4666666667
Countries in the state Arkansas has            the average population of 38878.90666666667
Countries in the state California has            the average population of 642309.5862068966
Countries in the state Colorado has            the average population of 78581.1875
Countries in the state Connecticut has            the average population of 446762.125
Countries in the state Delaware has            the average population of 299311.3333333333
Countries in the state District of Columbia has            the average population of 601723.0
Countries in the state Florida has            the average population of 280616.5671641791
Countries in the state Georgia has            the average population of 60928.63522012578
Countries in the state Hawaii has            the average population of 272060.2
Countries in the state Idaho has            the average population of 35626.86363636364
Countries in the state Illinois has            the average population of 125790.50980392157
Countries in the state Indiana has            the average population of 70476.10869565218
Countries in the state Iowa has            the average population of 30771.262626262625
Countries in the state Kansas has            the average population of 27172.55238095238
Countries in the state Kentucky has            the average population of 36161.39166666667

In [253]:
df = pd.read_csv('../Datasets/listings.csv')
df.head()

,id,listing_url,scrape_id,last_scraped,name,summary,space,description,experiences_offered,neighborhood_overview,...,review_scores_value,requires_license,license,jurisdiction_names,instant_bookable,cancellation_policy,require_guest_profile_picture,require_guest_phone_verification,calculated_host_listings_count,reviews_per_month
0,12147973,https://www.airbnb.com/rooms/12147973,20160906204935,2016-09-07,Sunny Bungalow in the City,"Cozy, sunny, family home. Master bedroom high...",The house has an open and cozy feel at the sam...,"Cozy, sunny, family home. Master bedroom high...",none,"Roslindale is quiet, convenient and friendly. ...",...,NaN,f,NaN,NaN,f,moderate,f,f,1,NaN
1,3075044,https://www.airbnb.com/rooms/3075044,20160906204935,2016-09-07,Charming room in pet friendly apt,Charming and quiet room in a second floor 1910...,Small but cozy and quite room with a full size...,Charming and quiet room in a second floor 1910...,none,"The room is in Roslindale, a diverse and prima...",...,9.0,f,NaN,NaN,t,moderate,f,f,1,1.30
2,6976,https://www.airbnb.com/rooms/6976,20160906204935,2016-09-07,Mexican Folk Art Haven in Boston,"Come stay with a friendly, middle-aged guy in ...","Come stay with a friendly, middle-aged guy in ...","Come stay with a friendly, middle-aged guy in ...",none,The LOCATION: Roslindale is a safe and diverse...,...,10.0,f,NaN,NaN,f,moderate,t,f,1,0.47
3,1436513,https://www.airbnb.com/rooms/1436513,20160906204935,2016-09-07,Spacious Sunny Bedroom Suite in Historic Home,Come experience the comforts of home away from...,Most places you find in Boston are small howev...,Come experience the comforts of home away from...,none,Roslindale is a lovely little neighborhood loc...,...,10.0,f,NaN,NaN,f,moderate,f,f,1,1.00
4,7651065,https://www.airbnb.com/rooms/7651065,20160906204935,2016-09-07,Come Home to Boston,"My comfy, clean and relaxing home is one block...","Clean, attractive, private room, one block fro...","My comfy, clean and relaxing home is one block...",none,"I love the proximity to downtown, the neighbor...",...,10.0,f,NaN,NaN,f,flexible,f,f,1,2.25

In [254]:
df[['cancellation_policy', 'review_scores_value']].head()
df.set_index(['cancellation_policy', 'review_scores_value'], inplace = True)

In [255]:
for group, frame in df.groupby(level=(0,1)):
    print(group)

('flexible', 2.0)
('flexible', 4.0)
('flexible', 5.0)
('flexible', 6.0)
('flexible', 7.0)
('flexible', 8.0)
('flexible', 9.0)
('flexible', 10.0)
('moderate', 2.0)
('moderate', 4.0)
('moderate', 6.0)
('moderate', 7.0)
('moderate', 8.0)
('moderate', 9.0)
('moderate', 10.0)
('strict', 2.0)
('strict', 3.0)
('strict', 4.0)
('strict', 5.0)
('strict', 6.0)
('strict', 7.0)
('strict', 8.0)
('strict', 9.0)
('strict', 10.0)
('super_strict_30', 6.0)
('super_strict_30', 7.0)
('super_strict_30', 8.0)
('super_strict_30', 9.0)
('super_strict_30', 10.0)

In [251]:
df.columns

Index(['id', 'listing_url', 'scrape_id', 'last_scraped', 'name', 'summary',
       'space', 'description', 'experiences_offered', 'neighborhood_overview',
       'notes', 'transit', 'access', 'interaction', 'house_rules',
       'thumbnail_url', 'medium_url', 'picture_url', 'xl_picture_url',
       'host_id', 'host_url', 'host_name', 'host_since', 'host_location',
       'host_about', 'host_response_time', 'host_response_rate',
       'host_acceptance_rate', 'host_is_superhost', 'host_thumbnail_url',
       'host_picture_url', 'host_neighbourhood', 'host_listings_count',
       'host_total_listings_count', 'host_verifications',
       'host_has_profile_pic', 'host_identity_verified', 'street',
       'neighbourhood', 'neighbourhood_cleansed',
       'neighbourhood_group_cleansed', 'city', 'state', 'zipcode', 'market',
       'smart_location', 'country_code', 'country', 'latitude', 'longitude',
       'is_location_exact', 'property_type', 'room_type', 'accommodates',
       'bathrooms', 'bedrooms', 'beds', 'bed_type', 'amenities', 'square_feet',
       'price', 'weekly_price', 'monthly_price', 'security_deposit',
       'cleaning_fee', 'guests_included', 'extra_people', 'minimum_nights',
       'maximum_nights', 'calendar_updated', 'has_availability',
       'availability_30', 'availability_60', 'availability_90',
       'availability_365', 'calendar_last_scraped', 'number_of_reviews',
       'first_review', 'last_review', 'review_scores_rating',
       'review_scores_accuracy', 'review_scores_cleanliness',
       'review_scores_checkin', 'review_scores_communication',
       'review_scores_location', 'requires_license', 'license',
       'jurisdiction_names', 'instant_bookable',
       'require_guest_profile_picture', 'require_guest_phone_verification',
       'calculated_host_listings_count', 'reviews_per_month'],
      dtype='object')

In [256]:
def grouping_fun(items):
    if items[1]==10.0:
        return (items[0], '10.0')
    else:
        return (items[0], 'not 10.0')

for group, frame in df.groupby(by = grouping_fun):
    print(group)

('flexible', '10.0')
('flexible', 'not 10.0')
('moderate', '10.0')
('moderate', 'not 10.0')
('strict', '10.0')
('strict', 'not 10.0')
('super_strict_30', '10.0')
('super_strict_30', 'not 10.0')

In [257]:
## Aggregation

In [259]:
df.reset_index(inplace = True)

In [261]:
df.groupby('cancellation_policy').agg({'review_scores_value':'mean'})

                     review_scores_value
cancellation_policy
flexible                        9.237421
moderate                        9.307398
strict                          9.081441
super_strict_30                 8.537313

In [264]:
# np.nanmean allow null values
df.groupby('cancellation_policy').agg({'review_scores_value':np.nanmean})

                     review_scores_value
cancellation_policy
flexible                        9.237421
moderate                        9.307398
strict                          9.081441
super_strict_30                 8.537313

In [263]:
df.groupby('cancellation_policy').agg({'review_scores_value':np.average})

                     review_scores_value
cancellation_policy
flexible                             NaN
moderate                             NaN
strict                               NaN
super_strict_30                      NaN

In [265]:
df.groupby('cancellation_policy').agg({'review_scores_value':(np.nanmean, np.nanstd),
                                       'reviews_per_month':np.nanmean
                                    })

                    review_scores_value           reviews_per_month
                                nanmean    nanstd           nanmean
cancellation_policy
flexible                       9.237421  1.096271          1.829210
moderate                       9.307398  0.859859          2.391922
strict                         9.081441  1.040531          1.873467
super_strict_30                8.537313  0.840785          0.340143

In [270]:
# Transformation
col = ['cancellation_policy', 'review_scores_value']

transform_df = df[col].groupby('cancellation_policy').transform(np.nanmean)
transform_df.head()

   review_scores_value
0             9.307398
1             9.307398
2             9.307398
3             9.307398
4             9.237421

In [273]:
transform_df.rename(columns=({'review_scores_value': 'mean_scores_value'}), inplace = True)
transform_df.head()

   mean_scores_value
0           9.307398
1           9.307398
2           9.307398
3           9.307398
4           9.237421

In [274]:
df = df.merge(transform_df, left_index=True, right_index= True)

In [276]:
df.head()

,cancellation_policy,review_scores_value,id,listing_url,scrape_id,last_scraped,name,summary,space,description,...,review_scores_location,requires_license,license,jurisdiction_names,instant_bookable,require_guest_profile_picture,require_guest_phone_verification,calculated_host_listings_count,reviews_per_month,mean_scores_value
0,moderate,NaN,12147973,https://www.airbnb.com/rooms/12147973,20160906204935,2016-09-07,Sunny Bungalow in the City,"Cozy, sunny, family home. Master bedroom high...",The house has an open and cozy feel at the sam...,"Cozy, sunny, family home. Master bedroom high...",...,NaN,f,NaN,NaN,f,f,f,1,NaN,9.307398
1,moderate,9.0,3075044,https://www.airbnb.com/rooms/3075044,20160906204935,2016-09-07,Charming room in pet friendly apt,Charming and quiet room in a second floor 1910...,Small but cozy and quite room with a full size...,Charming and quiet room in a second floor 1910...,...,9.0,f,NaN,NaN,t,f,f,1,1.30,9.307398
2,moderate,10.0,6976,https://www.airbnb.com/rooms/6976,20160906204935,2016-09-07,Mexican Folk Art Haven in Boston,"Come stay with a friendly, middle-aged guy in ...","Come stay with a friendly, middle-aged guy in ...","Come stay with a friendly, middle-aged guy in ...",...,9.0,f,NaN,NaN,f,t,f,1,0.47,9.307398
3,moderate,10.0,1436513,https://www.airbnb.com/rooms/1436513,20160906204935,2016-09-07,Spacious Sunny Bedroom Suite in Historic Home,Come experience the comforts of home away from...,Most places you find in Boston are small howev...,Come experience the comforts of home away from...,...,10.0,f,NaN,NaN,f,f,f,1,1.00,9.307398
4,flexible,10.0,7651065,https://www.airbnb.com/rooms/7651065,20160906204935,2016-09-07,Come Home to Boston,"My comfy, clean and relaxing home is one block...","Clean, attractive, private room, one block fro...","My comfy, clean and relaxing home is one block...",...,9.0,f,NaN,NaN,f,f,f,1,2.25,9.237421

In [277]:
df['mean_diff'] = np.absolute(df['review_scores_value'] -df['mean_scores_value'])

In [278]:
df[['review_scores_value', 'mean_scores_value', 'mean_diff']].head()

   review_scores_value  mean_scores_value  mean_diff
0                  NaN           9.307398        NaN
1                  9.0           9.307398   0.307398
2                 10.0           9.307398   0.692602
3                 10.0           9.307398   0.692602
4                 10.0           9.237421   0.762579

In [281]:
## Filtering
filtering_df = df.groupby('cancellation_policy').filter(lambda x: np.nanmean(x['review_scores_value'])>9.2)
filtering_df.shape

(1918, 97)

In [282]:
df.shape

(3585, 97)

In [285]:
# Applying
df = pd.read_csv('../Datasets/listings.csv')
df = df[['cancellation_policy', 'review_scores_value']]
df.head()

  cancellation_policy  review_scores_value
0            moderate                  NaN
1            moderate                  9.0
2            moderate                 10.0
3            moderate                 10.0
4            flexible                 10.0

In [286]:
def calc_mean_review_scores(group):
    avg = np.nanmean(group['review_scores_value'])
    group['review_score_mean'] = np.absolute(avg - group['review_scores_value'])

    return group

In [287]:
df.groupby('cancellation_policy').apply(calc_mean_review_scores).head()

  cancellation_policy  review_scores_value  review_score_mean
0            moderate                  NaN                NaN
1            moderate                  9.0           0.307398
2            moderate                 10.0           0.692602
3            moderate                 10.0           0.692602
4            flexible                 10.0           0.762579

In [ ]:
# nominal ==> categorial
## .astype(...)
## Categorical type

In [288]:
import pandas as pd
df = pd.DataFrame(['A+','A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'],
                  index =['excellent','excellent','excellent', 'good','good', 'good', 
                  'ok','ok','ok', 'poor','poor'],
                  columns = ['Grades']
)
df

          Grades
excellent     A+
excellent      A
excellent     A-
good          B+
good           B
good          B-
ok            C+
ok             C
ok            C-
poor          D+
poor           D

In [289]:
df.dtypes

Grades    object
dtype: object

In [290]:
df['Grades'].astype('category').head()

excellent    A+
excellent     A
excellent    A-
good         B+
good          B
Name: Grades, dtype: category
Categories (11, object): ['A', 'A+', 'A-', 'B', ..., 'C+', 'C-', 'D', 'D+']

In [294]:
my_categories = pd.CategoricalDtype(
    categories=['D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A', 'A+'],
    ordered = True)
grades = df['Grades'].astype(my_categories)
grades

excellent    A+
excellent     A
excellent    A-
good         B+
good          B
good         B-
ok           C+
ok            C
ok           C-
poor         D+
poor          D
Name: Grades, dtype: category
Categories (11, object): ['D' < 'D+' < 'C-' < 'C' ... 'B+' < 'A-' < 'A' < 'A+']

In [297]:
df[df['Grades']>'C']

     Grades
ok       C+
ok       C-
poor     D+
poor      D

In [300]:
grades[grades>'C']

excellent    A+
excellent     A
excellent    A-
good         B+
good          B
good         B-
ok           C+
Name: Grades, dtype: category
Categories (11, object): ['D' < 'D+' < 'C-' < 'C' ... 'B+' < 'A-' < 'A' < 'A+']

In [323]:
import numpy as np
df = pd.read_csv('../Datasets/census.csv')
df = df[df['SUMLEV']==50]

In [319]:
df.set_index('STNAME', inplace = True)
df = df[['CENSUS2010POP']]
df = df.groupby(level=0).agg({'CENSUS2010POP':np.nanmean})
df.head()

            CENSUS2010POP
STNAME
Alabama      71339.343284
Alaska       24490.724138
Arizona     426134.466667
Arkansas     38878.906667
California  642309.586207

In [306]:
df = df.set_index('STNAME').groupby(level=0)['CENSUS2010POP'].agg(np.nanmean)
df.head()

STNAME
Alabama        71339.343284
Alaska         24490.724138
Arizona       426134.466667
Arkansas       38878.906667
California    642309.586207
Name: CENSUS2010POP, dtype: float64

In [312]:
pd.cut(df, 10)

STNAME
Alabama                   (11706.087, 75333.413]
Alaska                    (11706.087, 75333.413]
Arizona                 (390320.176, 453317.529]
Arkansas                  (11706.087, 75333.413]
California              (579312.234, 642309.586]
Colorado                 (75333.413, 138330.766]
Connecticut             (390320.176, 453317.529]
Delaware                (264325.471, 327322.823]
District of Columbia    (579312.234, 642309.586]
Florida                 (264325.471, 327322.823]
Georgia                   (11706.087, 75333.413]
Hawaii                  (264325.471, 327322.823]
Idaho                     (11706.087, 75333.413]
Illinois                 (75333.413, 138330.766]
Indiana                   (11706.087, 75333.413]
Iowa                      (11706.087, 75333.413]
Kansas                    (11706.087, 75333.413]
Kentucky                  (11706.087, 75333.413]
Louisiana                 (11706.087, 75333.413]
Maine                    (75333.413, 138330.766]
Maryland                (201328.118, 264325.471]
Massachusetts           (453317.529, 516314.881]
Michigan                 (75333.413, 138330.766]
Minnesota                 (11706.087, 75333.413]
Mississippi               (11706.087, 75333.413]
Missouri                  (11706.087, 75333.413]
Montana                   (11706.087, 75333.413]
Nebraska                  (11706.087, 75333.413]
Nevada                  (138330.766, 201328.118]
New Hampshire            (75333.413, 138330.766]
New Jersey              (390320.176, 453317.529]
New Mexico                (11706.087, 75333.413]
New York                (264325.471, 327322.823]
North Carolina           (75333.413, 138330.766]
North Dakota              (11706.087, 75333.413]
Ohio                     (75333.413, 138330.766]
Oklahoma                  (11706.087, 75333.413]
Oregon                   (75333.413, 138330.766]
Pennsylvania            (138330.766, 201328.118]
Rhode Island            (201328.118, 264325.471]
South Carolina           (75333.413, 138330.766]
South Dakota              (11706.087, 75333.413]
Tennessee                 (11706.087, 75333.413]
Texas                    (75333.413, 138330.766]
Utah                     (75333.413, 138330.766]
Vermont                   (11706.087, 75333.413]
Virginia                  (11706.087, 75333.413]
Washington              (138330.766, 201328.118]
West Virginia             (11706.087, 75333.413]
Wisconsin                (75333.413, 138330.766]
Wyoming                   (11706.087, 75333.413]
Name: CENSUS2010POP, dtype: category
Categories (10, interval[float64, right]): [(11706.087, 75333.413] < (75333.413, 138330.766] < (138330.766, 201328.118] < (201328.118, 264325.471] ... (390320.176, 453317.529] < (453317.529, 516314.881] < (516314.881, 579312.234] < (579312.234, 642309.586]]

## Pivot Tables

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('../Datasets/cwurData.csv')
df.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [3]:
def rank_universities(ranking):
    if ranking >1 and ranking<=100:
        text = 'First Tier Top University'
    elif ranking >100 and ranking<=200:
        text = 'Second Tier Top University'
    elif ranking >201 and ranking<=300:
        text = 'Third Tier Top University'
    else:
        text = 'Other Top University'
    return text

df['rank_university'] = df['world_rank'].apply(lambda x: rank_universities(x))
df.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year,rank_university
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012,Other Top University
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012,First Tier Top University
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012,First Tier Top University
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012,First Tier Top University
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012,First Tier Top University

In [6]:
df.columns

Index(['world_rank', 'institution', 'country', 'national_rank',
       'quality_of_education', 'alumni_employment', 'quality_of_faculty',
       'publications', 'influence', 'citations', 'broad_impact', 'patents',
       'score', 'year', 'rank_university'],
      dtype='object')

In [7]:
df['rank_university'].unique()

array(['Other Top University', 'First Tier Top University',
       'Second Tier Top University', 'Third Tier Top University'],
      dtype=object)

In [8]:
df.pivot_table(values = 'score', index = 'country', columns = 'rank_university', aggfunc=[np.mean]).head()

                                     mean                       \
rank_university First Tier Top University Other Top University
country
Argentina                             NaN            44.672857
Australia                         47.9425            44.645750
Austria                               NaN            44.864286
Belgium                           51.8750            45.081000
Brazil                                NaN            44.499706


rank_university Second Tier Top University Third Tier Top University
country
Argentina                              NaN                       NaN
Australia                          49.2425                 47.285000
Austria                                NaN                 47.066667
Belgium                            49.0840                 46.746667
Brazil                             49.5650                       NaN

In [9]:
df.pivot_table(values = 'score', index = 'country', columns = 'rank_university', aggfunc=[np.mean, np.max]).head()

                                     mean                       \
rank_university First Tier Top University Other Top University
country
Argentina                             NaN            44.672857
Australia                         47.9425            44.645750
Austria                               NaN            44.864286
Belgium                           51.8750            45.081000
Brazil                                NaN            44.499706

                                                                      \
rank_university Second Tier Top University Third Tier Top University
country
Argentina                              NaN                       NaN
Australia                          49.2425                 47.285000
Austria                                NaN                 47.066667
Belgium                            49.0840                 46.746667
Brazil                             49.5650                       NaN

                                     amax                       \
rank_university First Tier Top University Other Top University
country
Argentina                             NaN                45.66
Australia                           51.61                45.97
Austria                               NaN                46.29
Belgium                             52.03                46.21
Brazil                                NaN                46.08


rank_university Second Tier Top University Third Tier Top University
country
Argentina                              NaN                       NaN
Australia                            50.40                     47.47
Austria                                NaN                     47.78
Belgium                              49.73                     47.14
Brazil                               49.82                       NaN

In [10]:
df.pivot_table(values = 'score', index = 'country', columns = 'rank_university', aggfunc=[np.mean, np.max],
               margins= True).head()

                                     mean                       \
rank_university First Tier Top University Other Top University
country
Argentina                             NaN            44.672857
Australia                         47.9425            44.645750
Austria                               NaN            44.864286
Belgium                           51.8750            45.081000
Brazil                                NaN            44.499706

                                                                      \
rank_university Second Tier Top University Third Tier Top University
country
Argentina                              NaN                       NaN
Australia                          49.2425                 47.285000
Austria                                NaN                 47.066667
Belgium                            49.0840                 46.746667
Brazil                             49.5650                       NaN

                                                amax                       \
rank_university        All First Tier Top University Other Top University
country
Argentina        44.672857                       NaN                45.66
Australia        45.825517                     51.61                45.97
Austria          45.139583                       NaN                46.29
Belgium          47.011000                     52.03                46.21
Brazil           44.781111                       NaN                46.08


rank_university Second Tier Top University Third Tier Top University    All
country
Argentina                              NaN                       NaN  45.66
Australia                            50.40                     47.47  51.61
Austria                                NaN                     47.78  47.78
Belgium                              49.73                     47.14  52.03
Brazil                               49.82                       NaN  49.82

In [13]:
new_df = df.pivot_table(values = 'score', index = 'country', columns = 'rank_university', aggfunc=[np.mean, np.max],
               margins= True)

print(new_df.index)
print(new_df.columns)

Index(['Argentina', 'Australia', 'Austria', 'Belgium', 'Brazil', 'Bulgaria',
       'Canada', 'Chile', 'China', 'Colombia', 'Croatia', 'Cyprus',
       'Czech Republic', 'Denmark', 'Egypt', 'Estonia', 'Finland', 'France',
       'Germany', 'Greece', 'Hong Kong', 'Hungary', 'Iceland', 'India', 'Iran',
       'Ireland', 'Israel', 'Italy', 'Japan', 'Lebanon', 'Lithuania',
       'Malaysia', 'Mexico', 'Netherlands', 'New Zealand', 'Norway', 'Poland',
       'Portugal', 'Puerto Rico', 'Romania', 'Russia', 'Saudi Arabia',
       'Serbia', 'Singapore', 'Slovak Republic', 'Slovenia', 'South Africa',
       'South Korea', 'Spain', 'Sweden', 'Switzerland', 'Taiwan', 'Thailand',
       'Turkey', 'USA', 'Uganda', 'United Arab Emirates', 'United Kingdom',
       'Uruguay', 'All'],
      dtype='object', name='country')
MultiIndex([('mean',  'First Tier Top University'),
            ('mean',       'Other Top University'),
            ('mean', 'Second Tier Top University'),
            ('mean',  'Third Tier Top University'),
            ('mean',                        'All'),
            ('amax',  'First Tier Top University'),
            ('amax',       'Other Top University'),
            ('amax', 'Second Tier Top University'),
            ('amax',  'Third Tier Top University'),
            ('amax',                        'All')],
           names=[None, 'rank_university'])

In [14]:
new_df['mean']['First Tier Top University'].head()

country
Argentina        NaN
Australia    47.9425
Austria          NaN
Belgium      51.8750
Brazil           NaN
Name: First Tier Top University, dtype: float64

In [15]:
type(new_df['mean']['First Tier Top University'])

pandas.core.series.Series

In [20]:
# Because it is a series with an index
new_df['mean']['First Tier Top University'].idxmax()

'United Kingdom'

In [21]:
new_df.head()

                                     mean                       \
rank_university First Tier Top University Other Top University
country
Argentina                             NaN            44.672857
Australia                         47.9425            44.645750
Austria                               NaN            44.864286
Belgium                           51.8750            45.081000
Brazil                                NaN            44.499706

                                                                      \
rank_university Second Tier Top University Third Tier Top University
country
Argentina                              NaN                       NaN
Australia                          49.2425                 47.285000
Austria                                NaN                 47.066667
Belgium                            49.0840                 46.746667
Brazil                             49.5650                       NaN

                                                amax                       \
rank_university        All First Tier Top University Other Top University
country
Argentina        44.672857                       NaN                45.66
Australia        45.825517                     51.61                45.97
Austria          45.139583                       NaN                46.29
Belgium          47.011000                     52.03                46.21
Brazil           44.781111                       NaN                46.08


rank_university Second Tier Top University Third Tier Top University    All
country
Argentina                              NaN                       NaN  45.66
Australia                            50.40                     47.47  51.61
Austria                                NaN                     47.78  47.78
Belgium                              49.73                     47.14  52.03
Brazil                               49.82                       NaN  49.82

In [23]:
new_df = new_df.stack()
new_df.head()
#transpusimos el dataframe

                                           mean   amax
country   rank_university
Argentina Other Top University        44.672857  45.66
          All                         44.672857  45.66
Australia First Tier Top University   47.942500  51.61
          Other Top University        44.645750  45.97
          Second Tier Top University  49.242500  50.40

In [24]:
new_df.unstack().head() # restore the dataframe

                                     mean                       \
rank_university First Tier Top University Other Top University
country
All                             57.929975            44.900292
Argentina                             NaN            44.672857
Australia                       47.942500            44.645750
Austria                               NaN            44.864286
Belgium                         51.875000            45.081000

                                                                      \
rank_university Second Tier Top University Third Tier Top University
country
All                               49.06545                 46.834848
Argentina                              NaN                       NaN
Australia                         49.24250                 47.285000
Austria                                NaN                 47.066667
Belgium                           49.08400                 46.746667

                                                amax                       \
rank_university        All First Tier Top University Other Top University
country
All              47.798395                     99.09               100.00
Argentina        44.672857                       NaN                45.66
Australia        45.825517                     51.61                45.97
Austria          45.139583                       NaN                46.29
Belgium          47.011000                     52.03                46.21


rank_university Second Tier Top University Third Tier Top University     All
country
All                                  51.29                     47.83  100.00
Argentina                              NaN                       NaN   45.66
Australia                            50.40                     47.47   51.61
Austria                                NaN                     47.78   47.78
Belgium                              49.73                     47.14   52.03

In [26]:
new_df.unstack().unstack().head()

      rank_university            country
mean  First Tier Top University  All          57.929975
                                 Argentina          NaN
                                 Australia    47.942500
                                 Austria            NaN
                                 Belgium      51.875000
dtype: float64

In [27]:
type(new_df.unstack().unstack())

pandas.core.series.Series

### Date Time Funtionality

In [28]:
import pandas as pd
import numpy as np

### Timestamp

In [29]:
pd.Timestamp('9/1/2022 10:05 AM')

Timestamp('2022-09-01 10:05:00')

In [30]:
pd.Timestamp(2022,9,1,10,5)

Timestamp('2022-09-01 10:05:00')

In [31]:
pd.Timestamp(2022,9,1,10,5).isoweekday()

4

In [35]:
pd.Timestamp(2022,9,1,10,5, 50).second

50

### Period

In [36]:
pd.Period('1/2016')

Period('2016-01', 'M')

In [37]:
pd.Period('1/6/2016')

Period('2016-01-06', 'D')

In [38]:
type(pd.Period('1/6/2016'))

pandas._libs.tslibs.period.Period

In [39]:
pd.Period('1/2016')+5

Period('2016-06', 'M')

In [41]:
pd.Period('1/6/2016')-3
# period encapsulates the granularity for arithmetics

Period('2016-01-03', 'D')

### DatetimeIndex and PeriodIndex

In [44]:
t1 = pd.Series(data= list('abd'), 
index = [pd.Timestamp(2019,1,1) , pd.Timestamp(2019,1,2), pd.Timestamp(2019,1,3)])
t1

2019-01-01    a
2019-01-02    b
2019-01-03    d
dtype: object

In [45]:
type(t1.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [46]:
t2 = pd.Series(data = list('def'),
               index = [pd.Period('2019-1'), pd.Period('2019-2'), pd.Period('2019-3')])
t2

2019-01    d
2019-02    e
2019-03    f
Freq: M, dtype: object

In [47]:
type(t2.index)

pandas.core.indexes.period.PeriodIndex

### Converting to DataFrame

In [53]:
d1 = ['2 June 2013', 'Aug 29, 2014', '2015-06-26', '7/12/16']
ts3 = pd.DataFrame(columns = list('ab'), 
                   data = np.random.randint(10, 100, (4,2)),
                   index = d1)
ts3

               a   b
2 June 2013   16  95
Aug 29, 2014  19  94
2015-06-26    34  19
7/12/16       79  92

In [54]:
ts3.index = pd.to_datetime(ts3.index)
ts3

             a   b
2013-06-02  16  95
2014-08-29  19  94
2015-06-26  34  19
2016-07-12  79  92

In [55]:
pd.to_datetime('4.7.12', dayfirst = True)

Timestamp('2012-07-04 00:00:00')

### Timedelta

In [58]:
pd.Timestamp('2016-01-20') - pd.Timestamp('2016-01-09')

Timedelta('11 days 00:00:00')

In [61]:
pd.Timestamp('2016-01-20 8:10AM') + pd.Timedelta('12D 3H')

Timestamp('2016-02-01 11:10:00')

### Offset

In [62]:
pd.Timestamp('9/4/2016').weekday()

6

In [63]:
pd.Timestamp('9/4/2016')+pd.offsets.Week()

Timestamp('2016-09-11 00:00:00')

In [64]:
pd.Timestamp('9/4/2016')+pd.offsets.MonthEnd()

Timestamp('2016-09-30 00:00:00')

### Working with Dates in a Dataframe

In [70]:
dates = pd.date_range(start = '2016-10-01', periods = 9, freq = '2W-SUN')
dates

DatetimeIndex(['2016-10-02', '2016-10-16', '2016-10-30', '2016-11-13',
               '2016-11-27', '2016-12-11', '2016-12-25', '2017-01-08',
               '2017-01-22'],
              dtype='datetime64[ns]', freq='2W-SUN')

In [69]:
dates = pd.date_range(start= '2016-10-01', periods=9, freq = 'B')
dates

DatetimeIndex(['2016-10-03', '2016-10-04', '2016-10-05', '2016-10-06',
               '2016-10-07', '2016-10-10', '2016-10-11', '2016-10-12',
               '2016-10-13'],
              dtype='datetime64[ns]', freq='B')

In [73]:
pd.date_range(start= '2016-01-01', periods=9, freq = 'QS')

DatetimeIndex(['2016-01-01', '2016-04-01', '2016-07-01', '2016-10-01',
               '2017-01-01', '2017-04-01', '2017-07-01', '2017-10-01',
               '2018-01-01'],
              dtype='datetime64[ns]', freq='QS-JAN')

In [74]:
pd.date_range(start= '2016-01-01', periods=9, freq = 'QS-JUN')

DatetimeIndex(['2016-03-01', '2016-06-01', '2016-09-01', '2016-12-01',
               '2017-03-01', '2017-06-01', '2017-09-01', '2017-12-01',
               '2018-03-01'],
              dtype='datetime64[ns]', freq='QS-JUN')

In [75]:
dates = pd.date_range(start = '2016-10-01', periods= 9, freq = '2W-SUN')
dates

DatetimeIndex(['2016-10-02', '2016-10-16', '2016-10-30', '2016-11-13',
               '2016-11-27', '2016-12-11', '2016-12-25', '2017-01-08',
               '2017-01-22'],
              dtype='datetime64[ns]', freq='2W-SUN')

In [80]:
100 + np.random.randint(-5, 10, 9).cumsum()

array([103, 105, 108, 103,  99, 102, 105, 109, 111])

array([118, 120, 122, 117, 122, 120, 121, 120, 122])

In [84]:
df = pd.DataFrame({'Count 1': 100 + np.random.randint(-5, 10, 9).cumsum(),
                   'Count 2': 120 + np.random.randint(-5, 10, 9).cumsum()},
                index = dates
)
df

            Count 1  Count 2
2016-10-02       96      123
2016-10-16      102      118
2016-10-30      108      122
2016-11-13      117      124
2016-11-27      118      132
2016-12-11      118      137
2016-12-25      115      133
2017-01-08      115      137
2017-01-22      114      141

In [88]:
df.index.day_of_week

Int64Index([6, 6, 6, 6, 6, 6, 6, 6, 6], dtype='int64')

In [92]:
# get the difference between the current value with the previous one
df.diff()

            Count 1  Count 2
2016-10-02      NaN      NaN
2016-10-16      6.0     -5.0
2016-10-30      6.0      4.0
2016-11-13      9.0      2.0
2016-11-27      1.0      8.0
2016-12-11      0.0      5.0
2016-12-25     -3.0     -4.0
2017-01-08      0.0      4.0
2017-01-22     -1.0      4.0

In [93]:
df.resample('M').mean()

            Count 1  Count 2
2016-10-31    102.0    121.0
2016-11-30    117.5    128.0
2016-12-31    116.5    135.0
2017-01-31    114.5    139.0

In [94]:
df['2017']

/tmp/ipykernel_7593/1797912031.py:1: FutureWarning: Indexing a DataFrame with a datetimelike index using a single string to slice the rows, like `frame[string]`, is deprecated and will be removed in a future version. Use `frame.loc[string]` instead.
  df['2017']

            Count 1  Count 2
2017-01-08      115      137
2017-01-22      114      141

In [95]:
df['2016-12']

/tmp/ipykernel_7593/2391205231.py:1: FutureWarning: Indexing a DataFrame with a datetimelike index using a single string to slice the rows, like `frame[string]`, is deprecated and will be removed in a future version. Use `frame.loc[string]` instead.
  df['2016-12']

            Count 1  Count 2
2016-12-11      118      137
2016-12-25      115      133

In [96]:
df['2016-12':]

            Count 1  Count 2
2016-12-11      118      137
2016-12-25      115      133
2017-01-08      115      137
2017-01-22      114      141

In [97]:
df.index

DatetimeIndex(['2016-10-02', '2016-10-16', '2016-10-30', '2016-11-13',
               '2016-11-27', '2016-12-11', '2016-12-25', '2017-01-08',
               '2017-01-22'],
              dtype='datetime64[ns]', freq='2W-SUN')

In [98]:
df.loc['2016-10-02']

Count 1     96
Count 2    123
Name: 2016-10-02 00:00:00, dtype: int64

In [104]:
import pandas as pd
df = pd.DataFrame(['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'], index=['excellent', 'excellent', 'excellent', 'good', 'good', 'good', 'ok', 'ok', 'ok', 'poor', 'poor'], columns = ['Grades'])
my_categories = pd.CategoricalDtype(categories=['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'], ordered= True)

In [105]:

grades = df['Grades'].astype(my_categories)
result = grades[(grades>'B') & (grades<'A')]

In [106]:
result

Series([], Name: Grades, dtype: category
Categories (11, object): ['A+' < 'A' < 'A-' < 'B+' ... 'C' < 'C-' < 'D+' < 'D'])

In [107]:
pd.Period('01/12/2019', 'M') + 5

Period('2019-06', 'M')

In [109]:
import pandas as pd
df = pd.DataFrame(['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'], index=['excellent', 'excellent', 'excellent', 'good', 'good', 'good', 'ok', 'ok', 'ok', 'poor', 'poor'], columns = ['Grades'])
my_categories = pd.CategoricalDtype(categories=['D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A', 'A+'], ordered=True)
grades = df['Grades'].astype(my_categories)
result = grades[(grades>'B') & (grades<'A')]
result

excellent    A-
good         B+
Name: Grades, dtype: category
Categories (11, object): ['D' < 'D+' < 'C-' < 'C' ... 'B+' < 'A-' < 'A' < 'A+']

In [110]:
# if you dont like to see the warnings
import warnings
warnings.filterwarnings('ignore')